<h3>Gel&#xE4;nde unterteilen</h3>
<div class="comDescr">
	<div class="field"><strong>Wo befindet sich dieser Befehl?</strong></div>
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laGel&#xE4;ndeUnterteilen</div>
	
	<div class="field">Symbol: </div>
	<div class="value icon"><img src="../images/Icon/laTerrainDivide.png" alt="Unterteilen"/> Linksklick

	</div>
	
	<div class="field"><a href="Interface_Toolbars.html#TerrainToolbar">Werkzeugleiste</a>: </div>
	<div class="value toolbar"><img src="../images/Toolbar/Terrain Toolbar.png" alt="Gel&#xE4;nde-Befehle" usemap ="#TerrainToolbarMap" /></div>
	
	<div class="field"><a href="Interface_Drop-down.html">Men&#xFC;</a>: </div>
	<div class="value menu">Lands Design &gt; Gel&#xE4;ndemodellierung &gt; Gel&#xE4;nde &gt; Unterteilen</div>
	
	<div class="field"><a href="Interface_Panel.html">Bearbeitungspanel</a>: </div>
	<div class="value menu">Ein Gel&#xE4;nde ausw&#xE4;hlen &gt; Bearbeitungsbereich im Bearbeitungspanel &gt; Gel&#xE4;nde &gt; Unterteilen</div>
</div>

<p>Dieser Befehl teilt das Gel&#xE4;nde unter Verwendung einer geschlossenen Kurve in zwei Teile und erzeugt eine Zone darauf. Die neue Unterteilung oder Region kann mit vom &#xFC;brigen Gel&#xE4;nde unterschiedlichem Material und Farbe versehen werden.</p>

<p><strong>Vorgehen:</strong></p>

<ol>
 <li>W&#xE4;hlen Sie ein <strong>Gel&#xE4;nde</strong>. Dann dr&#xFC;cken Sie Eingabe oder klicken Sie auf die rechte Maustaste.</li>
  <li>W&#xE4;hlen Sie eine <strong>geschlossene Kurve</strong>.</li>
</ol>

<p>Die Unterteilung wird im Gel&#xE4;nde erzeugt.</p>

<p class="figureWithDescription"><img src="../images/commands/Terrain/Divide 1.jpg" alt="Gel&#xE4;nde und die zum Erzeugen der Unterteilung ausgew&#xE4;hlte Kurve"/><br/>
Gel&#xE4;nde und die zum Erzeugen der Unterteilung ausgew&#xE4;hlte Kurve.
</p>

<p class="figureWithDescription"><img src="../images/commands/Terrain/Divide 2.jpg" alt="Unterteiltes Gel&#xE4;nde"/><br/>
In zwei Bereiche unterteiltes Gel&#xE4;nde.
</p>


<a name="Parameters" />
<h3>Parameter</h3>

<p>Die Unterteilungsparameter k&#xF6;nnen im Reiter <em>Eingabedaten</em> bearbeitet werden (im <a href="Interface_Panel.html#Properties">Eigenschaftenbereich des Bearbeitungspanels</a> oder im <a href="Interface_Properties.html">Eigenschaftenexplorer-Dialog</a>), unter der <em>Unterteilungs</em>-Liste.</p>
<ul>
<li><strong>Kontrollpunkte</strong>: Option zum Aktivieren oder Deaktivieren der Kontrollpunkte des Bereichs Unterteilung.</li>
<li><strong>Zone</strong>: erzeugt ein Zonenobjekt im selben Bereich. Die Einstellungen sind die gleichen wie die einer mit dem Befehl <a href="Commands_laZonify.html">laVerzonen</a> erzeugten Zone und k&#xF6;nnen auf dem Reiter <em>Zone</em> bearbeitet werden, im <a href="Interface_Panel.html#Properties">Eigenschaftenbereich des Bearbeitungspanels</a> oder des <a href="Interface_Properties.html">Eigenschaftenexplorer-Dialogs</a>, nach Auswahl der Unterteilung in der <a href="Interface_Panel.html#List">Objektauswahl-Liste des Bearbeitungspanels</a> oder im <a href="Interface_Properties.html">Eigenschaftenexplorer-Dialog</a>.</li>
</ul>

<p class="figureWithDescription"><img src="../images/commands/Terrain/Division Input Data.png" alt="Gel&#xE4;ndeunterteilung-Attribute"/><br/>
Gel&#xE4;ndeunterteilung-Attribute.
</p>


<h3>Unterteilungsattribute</h3>
<p>Farbe und Material der unterteilten Zone &#xFC;bernehmen standardm&#xE4;&#xDF;ig die Gel&#xE4;ndeattribute, k&#xF6;nnen aber auf dem Reiter <em>Material</em> bearbeitet werden, im <a href="Interface_Panel.html#Properties">Eigenschaftenbereich des Bearbeitungspanels</a> oder im <a href="Interface_Properties.html">Eigenschaftenexplorer-Dialog</a>, nach Auswahl der Unterteilung in der <a href="Interface_Panel.html#List">Objektauswahl-Liste des Bearbeitungspanels</a> oder im <a href="Interface_Properties.html">Eigenschaftenexplorer-Dialog</a>.</p>
 
 <p class="figureWithDescription"><img src="../images/commands/Terrain/TerrainSubdivisionMaterial.png" alt="Reiter Material f&#xFC;r die Gel&#xE4;ndeunterteilung, im Bearbeitungspanel"/><br/>
Gel&#xE4;ndeunterteilung-Attribute.
</p>

<a name="ControlPoints" />
<h3>Kontrollpunkte <img alt="Kontrollpunkte" height="26" src="../images/Points on.png" width="26" /></h3>
<p>Die Kontrollpunkte der Gel&#xE4;ndeunterteilung erm&#xF6;glichen es Ihnen, die Unterteilungs-Kontur zu &#xE4;ndern. Sie sind die gleichen wie die der f&#xFC;r diese Operation verwendeten Kurven. Zus&#xE4;tzlich gibt es einen Kontrollpfeil zum Verschieben der gesamten Unterteilungsposition.</p>
<p>Diese Kontrollpunkte sind in das Gel&#xE4;nde integriert und werden bei Aktivierung der Gel&#xE4;nde-Kontrollpunkte sichtbar.</p>
<p>Sie k&#xF6;nnen im Reiter <em>Eingabedaten</em> deaktiviert werden (im <a href="Interface_Panel.html#Properties">Eigenschaftenbereich des Bearbeitungspanels</a> oder im <a href="Interface_Properties.html">Eigenschaftenexplorer-Dialog</a>), nach Auswahl der Unterteilung unter der <em>Unterteilungs</em>-Liste.</p>


