<h3>Reihe</h3>
<div class="comDescr">
	<div class="field"><strong>Wo befindet sich dieser Befehl?</strong></div>
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laReihe</div>
	
	<div class="field">Symbol: </div>
	<div class="value icon"><img src="../images/Icon/laRow.png" alt="Reihe"/> Linksklick

	</div>
	
	<div class="field"><a href="Interface_Toolbars.html#CivilWorkToolbar">Werkzeugleiste: Lands-Objekte</a></div>
	<div class="value toolbar"><img src="../images/Toolbar/Civil Work Toolbar.png" alt="Bau-Befehle" usemap ="#CivilWorkToolbarMap" /></div>
	
	<div class="field"><a href="Interface_Drop-down.html">Men&#xFC;</a>: </div>
	<div class="value menu">Lands Design &gt; Bau &gt; Reihe</div>
</div>

<p>Reihen ordnet Kopien von Lands-Design-Elementen oder anderen Objekten entlang einer Kurve an.</p>

<ul>
	<li><a href="Commands_laRow.html#Insert">Reihe einf&#xFC;gen</a></li>
	<li><a href="Commands_laRow.html#ControlPoints">Kontrollpunkte</a></li>
	<li><a href="Commands_laRow.html#Parameters">Einf&#xFC;gungsoptionen und -parameter</a></li>
	<li><a href="Commands_laRow.html#Edit">Bearbeitungsoptionen</a></li>
	<li><a href="Commands_laRow.html#Display">Graphische Darstellung</a></li>

</ul>
<a name="Insert" />
<h3>Reihe einf&#xFC;gen:</h3>
<p>Durch Ausf&#xFC;hren des Befehls <strong>laReihe</strong> wird der <a href="Interface_Dialog.html">Einf&#xFC;gedialog</a> f&#xFC;r Reihe ge&#xF6;ffnet. Dieser Dialog zeigt die grundlegenden Optionen des Reihenobjekts auf zwei verschiedenen Reitern an:</p>
<ul>
<li><a href="Commands_laRow.html#Sample">Muster</a>: Reihenelement-Parameter.</li>
<li><a href="Commands_laRow.html#Row">Reihe</a>: Reihenparameter.</li>
</ul> 
 
<p><strong>Vorgehen:</strong></p>

<ol>

<li>W&#xE4;hlen Sie ein <strong>Reihenelement</strong> unter dem Reiter <em>Muster</em>. Dieses Element kann auf drei verschiedene Arten definiert werden:
<ul>
	<li><img src="../images/BlockLibraryButton.png" alt="Auswahl aus Blockbibliothek"/> Ein Block aus der Blockbibliothek.</li>
	<li><img src="../images/BrowseButton.png" alt="Auswahl von PC"/> Eine Datei aus Ihrem PC.</li>
	<li><img src="../images/SelectButton.png" alt="Auswahl im Modell"/> Ein im Modell vorhandenes Objekt.</li>
</ul>
Nach der Auswahl wird eine Vorschau des Objekts im Dialog erscheinen.</li>
	<li>W&#xE4;hlen Sie die <a href="Commands_laRow.html#Parameters"><strong>Reihenparameter</strong></a> unter dem Reiter Reihe. Klicken Sie auf OK, um das Dialogfeld zu schlie&#xDF;en.</li>
	<li>W&#xE4;hlen Sie eine im Modell vorhandene <strong>Kurve</strong> aus, um die Reihe zu definieren, oder w&#xE4;hlen Sie eine unterschiedliche Option in der Befehlszeile.
		<ul>
			<li><strong>Polylinie</strong>: die Reihe wird so erzeugt, als ob Sie eine Polylinie zeichnen w&#xFC;rden.</li>
			<li><strong>Spline</strong>: die Reihe wird so erzeugt, als ob Sie einen Spline zeichnen w&#xFC;rden.</li>
			<li><strong>Kreis</strong>: die Reihe wird so erzeugt, als ob Sie einen Kreis zeichnen w&#xFC;rden. Mit dem ersten Klick wird die Kreismitte bestimmt, und mit dem zweiten Klick der Radius.</li>
			<li><strong>Bogen</strong>: die Reihe wird so erzeugt, als ob Sie einen Bogen zeichnen w&#xFC;rden. Mit dem ersten Klick wird der Einf&#xFC;gungspunkt bestimmt. Der zweite Klick bestimmt einen Mittelpunkt im Bogen. Mit dem dritten und letzten Klick wird bestimmt, wo der Bogen endet.</li>
			<li><strong>Rechteck</strong>: die Reihe wird so erzeugt, als ob Sie ein Rechteck zeichnen w&#xFC;rden. Mit dem ersten Klick wird eine Ecke des Rechtecks bestimmt, und mit dem zweiten Klick die gegen&#xFC;berliegende Ecke.</li>
		</ul>
	</li>
	<li>Beenden Sie den Befehl durch Dr&#xFC;cken von Eingabe, Esc oder Klicken auf die rechte Maustaste.</li>
</ol>

<p>Die Reihenparameter k&#xF6;nnen w&#xE4;hrend ihrer Einf&#xFC;gung und nach Beendigung des Befehls bearbeitet werden, und zwar im <a href="Interface_Panel.html">Lands-Design-Bearbeitungspanel</a>, im Abschnitt Eigenschaften, unter dem Reiter Reihe.</p>

<p class="figureWithDescription"><img src="../images/commands/Row/Row Insert Dialog.png" alt="Einf&#xFC;gedialog f&#xFC;r die Reihe."/><br/>
Einf&#xFC;gedialog f&#xFC;r das Reihenobjekt.
</p><br/>
<p><b>Hinweis</b>: Als Reihenmuster dient alles au&#xDF;er einer Pflanze. Um Pflanzenreihen zu erzeugen, verwenden Sie den Befehl <a href="Commands_laPlantRow.html">laPflanzenreihe</a>.</p>

<br clear="all" />
<a name="ControlPoints" />
<h3>Kontrollpunkte <img alt="Kontrollpunkte" height="26" src="../images/Points on.png" width="26" /></h3>
<p>Reihen haben dieselben <em>Kontrollpunkte</em> wie die zu ihrer Erzeugung verwendeten Kurven, ohne R&#xFC;cksicht auf die Zahl der Elemente oder ihre Position.</p>
<p>Zuz&#xFC;glich haben sie einen Kontrollpfeil zum Verschieben des gesamten Objekts.</p>
<p>Reihen-Kontrollpunkte werden bei der Einzelauswahl von Reihen automatisch aktiviert. Um einen oder mehrere Reihen-Kontrollpunkte zu aktivieren, w&#xE4;hlen Sie diese einfach aus und starten Sie den Befehl <strong>PunkteEin</strong> (oder dr&#xFC;cken Sie F10). Um die Punkte zu deaktivieren, dr&#xFC;cken Sie ESC oder starten Sie den Befehl <strong>PunkteAus</strong>.</p>


<div class="figureWithDescription block"><img src="../images/Commands/Row/Row Control Points.jpg" alt="Kontrollpunkte auf Reihen" /><br/>
Kontrollpunkte auf Reihen</div>
<br clear="all" />

<a name="Parameters" />
<h3>Einf&#xFC;geoptionen und -parameter</h3>
<p>Die Reihen-Einf&#xFC;gungsoptionen und -Parameter sind in unterschiedliche Reiter aufgeteilt und &#xFC;ber verschiedene Dialoge abrufbar:</p>
<ul>
	<li>Reihen-<a href="Interface_Dialog.html">Einf&#xFC;gungsdialog</a> (nur beim Einf&#xFC;gen neuer Reihen verf&#xFC;gbar).</li>
	<li>Abschnitt der Reihen-Eigenschaften, im <a href="Interface_Panel.html">Lands-Design-Bearbeitungspanel</a>.</li>
	<li>Reihen-<a href="Interface_Properties.html">Objekteigenschaftendialog</a>.</li>
</ul>

<h4>Allgemein</h4> 
<p>Allgemeine Attribute f&#xFC;r das Reihenobjekt: <em>Name</em>, <em>Farbe</em>, <em>Ebene</em>, <em>Code</em> und <em>Stichw&#xF6;rter</em>.</p>

<a name="Sample" />
<h4>Muster</h4> 
<p>Parameter f&#xFC;r die Reihenelemente:</p>
<ul>
	<li><strong>Muster</strong>: Reihenelement. Sie k&#xF6;nnen es entweder aus der Blockbibliothek ausw&#xE4;hlen oder von Ihrem PC, oder Sie k&#xF6;nnen auf ein im Modell vorhandenes Objekt klicken.</li>
	<li><strong>Drehung</strong>: Drehwinkel jedes Elements vom eigenen Einf&#xFC;gungspunkt.</li>
	<li><strong>Orientierung</strong>: vier Optionen sind verf&#xFC;gbar, um das Reihenelement in hinsichtlich der Reihenachsenkurve auszurichten:
		<ul>
			<li>Tangential zur Achse</li>
			<li>Rechtwinklig zur Achse</li>
			<li>An festem Punkt: Klicken Sie auf die Schaltfl&#xE4;che Punkt w&#xE4;hlen, um einen Punkt im Modell auszuw&#xE4;hlen.</li>
			<li>Gegebener Winkel</li>
		</ul>
		Mit dem Kontrollk&#xE4;stchen <strong>Umkehren</strong> wird die Ausrichtung jedes Elements um 180 Grad gedreht. Diese Option ist nur bei Auswahl der Ausrichtungsoptionen <em>Tangential zur Achse</em> und <em>Rechtwinklig zur Achse</em> verf&#xFC;gbar.
	</li>
</ul>

<p>Wenn Reihen mehr als ein Muster enthalten, sind die Parameter jeder einzelnen davon verf&#xFC;gbar, und zwar nach Auswahl des gew&#xFC;nschten Musters von der <a href="Interface_Panel.html#List">Objektauswahl-Liste</a> im <a href="Interface_Panel.html">Lands-Bearbeitungspanel</a>. </p>

<a name="Row" />
<h4>Reihe</h4> 
<p>Zum Verteilen der Elemente in Reihen sind zwei Optionen verf&#xFC;gbar:</p>
<ul>
	<li><strong>Anzahl Einheiten</strong>: zur Bestimmung der Gesamtmenge von Reihenelementen entlang der Reihen-Achsenkurve.</li>
	<li><strong>Trennung</strong>: zur Platzierung der Reihenelemente in einem gewissen Abstand, gem&#xE4;&#xDF; einer Ausrichtung auf der Reihenachsenkurve (am Anfang, zentriert oder am Ende).</li>
	<li><strong>Abstand zur Achse</strong>: zum Verschieben der Position von Elementen &#xFC;ber die Pfadkurve.</li>
</ul>
<p>Reihen k&#xF6;nnen unterschiedliche Elementmuster kombinieren:</p>

<ul>
	<li><strong>Anzahl Elemente</strong>: Geben Sie die Anzahl verschiedener Muster ein. Die Liste verschiedener Muster wird in der <a href="Interface_Panel.html#List">Liste zur Objektauswahl</a> im <a href="Interface_Panel.html">Lands-Bearbeitungspanel</a> erscheinen, wo sie zur Bearbeitung ihrer Parameter ausgew&#xE4;hlt werden k&#xF6;nnen.</li>
	<li><strong>Verteilung</strong>: Optionen zum Verteilen der Reihenelemente, wenn mehr als ein Mustertyp vorhanden ist.</li>
</ul>

<p>Eingef&#xFC;gte Einheiten: zeigt die genaue Anzahl von Elementeinheiten in der Reihe an.</p>
<a name="Material" />
<h4>Material</h4>
<p>Mit diesem Reiter k&#xF6;nnen Sie das diesem Element zugewiesene texturierte Bild &#xE4;ndern und Bildgr&#xF6;&#xDF;e und Reflexionsverm&#xF6;gen definieren.</p>


<a name="Edit" />
<h3>Bearbeitungsoptionen</h3>
<p>Dies sind die Bearbeitungsoptionen f&#xFC;r das Reihenobjekt, verf&#xFC;gbar im <a href="Interface_Panel.html#Edit">Bearbeitungsbereich des Bearbeitungsfensters</a>:</p>
<ul>
	<li><img alt="Aktualisieren" height="24" src="../images/Icon/laUpdate.png" width="24" /> <a href="Commands_laUpdate.html">Aktualisieren</a></li>
	<li><img alt="In 2D umwandeln" height="24" src="../images/Icon/laConvertTo2D.png" width="24" /> <a href="Commands_laConvertTo.html">In 2D umwandeln</a>. Zeigt das Objekt in der 2D-Darstellung an.</li>
	<li><img alt="In 3D umwandeln" height="24" src="../images/Icon/laConvertTo3D.png" width="24" /> <a href="Commands_laConvertTo.html">In 3D umwandeln</a>. Zeigt das Objekt in der 3D-Darstellung an.</li>
	<li><a href="Commands_laConvertTo.html">2D und 3D anzeigen</a>: <em>Aktiviert gleichzeitig die 2D- und 3D-Darstellung des Objekts.</em></li>


	<li><a href="Commands_laCopyFrom.html">Eigenschaften von einem anderen Objekt kopieren</a></li>
	<li><a href="Commands_laCopyToCurve.html">Auf eine andere Kurve kopieren</a></li>
	<li><a href="Commands_laReverseCurve.html">Kurve umkehren</a></li>
	<li><a href="Commands_laExtractCurves.html">Kurve extrahieren</a></li>
	<li>Anpassen
		<ul>
		<li><img alt="laErh&#xF6;hen" height="24" src="../images/Icon/laElevate.png" width="24" /> <a href="Commands_laElevate.html">Erh&#xF6;hung</a></li>
		<li><img alt="laAufNullErh&#xF6;hen" height="24" src="../images/Icon/laElevateToZero.png" width="24" /> <a href="Commands_laElevateToZero.html">Auf Nullh&#xF6;he</a></li>
		<li><img alt="AufGel&#xE4;ndeErh&#xF6;hen" height="24" src="../images/Icon/laElevateToTerrain.png" width="24" /> <a href="Commands_laElevateToTerrain.html">An Gel&#xE4;nde</a></li>
		</ul>
	</li>
	<li>Nicht an Gel&#xE4;nde anpassen</li>
	
</ul>	
	



<a name="Display" />
<h3>Grafische Darstellung der Reihe:</h3>
<p>Das Reihenobjekt bietet eine gleichzeitige 2D- und 3D-Darstellung der Zeichnung, je nach ausgew&#xE4;hltem Element. Wenn das Reihenelement aus der Blockbibliothek ausgew&#xE4;hlt wird, bietet es eine 2D- und 3D-Anzeige. Wenn das Element aus dem Modell ausgew&#xE4;hlt wird, verf&#xFC;gt es nur &#xFC;ber eine 3D-Anzeige.</p>

<table>
<tbody>
	<tr>
		<td>
			<div class="figureWithDescription block"><img src="../images/Commands/Row/Row 2D.jpg" alt="2D-Anzeige der Reihe"/>
 </div>
		</td>
		<td>
			<div class="figureWithDescription block"><img src="../images/Commands/Row/Row 3D.jpg" alt="3D-Anzeige der Reihe"/>
 </div>
		</td>
	</tr>
	<tr>
		<td align="center" width="200px">2D</td>
		<td align="center" width="200px">3D</td>
	</tr>
</tbody>
 </table>
