<h3>Wald</h3>
<div class="comDescr">
	<div class="field"><strong>Wo befindet sich dieser Befehl?</strong></div>
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laWald</div>
	
	<div class="field">Symbol: </div>
	<div class="value icon"><img src="../images/Icon/laForest.png" alt="Wald"/> Linksklick</div>
	
	<div class="field">Werkzeugleiste: <a href="Interface_Toolbars.html#ObjectsToolbar">Lands-Objekte</a></div>
	<div class="value toolbar"><img src="../images/Toolbar/Vegetation Toolbar.png" alt="Vegetationsbefehle" usemap ="#VegetationToolbarMap" /></div>
	
	<div class="field"><a href="Interface_Drop-down.html">Men&#xFC;</a>: </div>
	<div class="value menu">Lands Design &gt; Vegetation &gt; Wald</div>
</div>

<p>W&#xE4;lder ordnen Lands-Design-Pflanzenelemente innerhalb einer Begrenzungskurve an.</p>

<ul>
	<li><a href="Commands_laForest.html#Insert">Wald einf&#xFC;gen</a></li>
	<li><a href="Commands_laForest.html#ControlPoints">Kontrollpunkte</a></li>
	<li><a href="Commands_laForest.html#Parameters">Einf&#xFC;gungsoptionen und -parameter</a></li>
	<li><a href="Commands_laForest.html#Edit">Bearbeitungsoptionen</a></li>
	<li><a href="Commands_laForest.html#Display">Graphische Darstellung</a></li>

</ul>

<a name="Insert" />
<h3>Wald einf&#xFC;gen:</h3>
<p>Durch Ausf&#xFC;hren des Befehls <strong>laWald</strong> wird der Wald-<a href="Interface_Dialog.html">Einf&#xFC;gungsdialog</a> ge&#xF6;ffnet. Dieser Dialog zeigt die grundlegenden Optionen des Waldobjekts auf vier verschiedenen Reitern an:</p>
<ul>

<li><a href="Commands_laForest.html#Forest">Wald</a>: Parameter des Waldes.</li>
<li><a href="Commands_laForest.html#Plant">Pflanze</a>: Parameter der Pflanzenart-Elemente im Wald.</li>
<li><a href="Commands_laForest.html#Format">Format</a>: Format der Pflanzenarten im Wald.</li>
<li><a href="Commands_laForest.html#Render">Rendern</a>: Parameter zur Definierung, wie Pflanzenarten in W&#xE4;ldern in Renderdarstellungen aussehen.</li>
</ul>

<p><strong>Vorgehen:</strong></p>
<ol>
	<li>W&#xE4;hlen Sie eine <strong>Pflanzenart</strong> aus der Liste, unter dem Reiter Pflanze. Klicken Sie auf die Schaltfl&#xE4;che Durchsuchen... um eine neue aus der <a href="Commands_laPlantDatabase.html">Pflanzendatenbank</a> auszuw&#xE4;hlen. W&#xE4;hlen Sie die restlichen <strong>Pflanzenparameter</strong> aus.</li>
	<li>Wechseln Sie zum Reiter Wald und w&#xE4;hlen Sie die <strong>Wald-Parameter</strong> aus. Klicken Sie auf OK, um das Dialogfeld zu schlie&#xDF;en.</li>
	<li>Legen Sie eine Option in der Befehlszeile fest, um den Wald zu erzeugen:
		<ul>
			<li><strong>Einschr&#xE4;nkungen</strong>: w&#xE4;hlen Sie eine <strong>Kurve</strong> oder mehrere Kurven, um damit die Waldgrenzen zu definieren. Die Kurven m&#xFC;ssen geschlossene Kurven sein.</li>
			<li><strong>ErsterPunkt</strong>: Linksklick im Modell um die Waldbegrenzungskurve zu definieren, so als ob sie eine Polylinie zeichnen w&#xFC;rden. Klicken Sie mit der rechten Maustaste, um den Befehl zu beenden. Wenn der letzte Einf&#xFC;gungspunkt nicht auf dem ersten Punkt endet, wird der Begrenzung automatisch ein Segment hinzugef&#xFC;gt, um sie zu umschlie&#xDF;en.</li>
			<li><strong>InternerPunkt</strong>: (diese Option ist in der WIP-Version von Lands Design nicht verf&#xFC;gbar).</li>
		</ul>
	</li>
	<li>Beenden Sie den Befehl durch Dr&#xFC;cken von Eingabe, Esc oder Klicken auf die rechte Maustaste.</li>
</ol>

<p>Die Waldparameter k&#xF6;nnen w&#xE4;hrend des Einf&#xFC;gens und nach Beendigung des Befehls bearbeitet werden, und zwar im <a href="Interface_Panel.html">Lands-Design-Bearbeitungspanel</a>, im Abschnitt Eigenschaften, unter dem Reiter Wald.</p>

<p class="figureWithDescription"><img src="../images/commands/Forest/Forest insert dialog.png" alt="Einf&#xFC;gedialog f&#xFC;r den Wald."/><br/>
Einf&#xFC;gedialog f&#xFC;r das Waldobjekt.
</p><br/>

<br clear="all" />

<a name="ControlPoints" />
<h3>Kontrollpunkte <img alt="Kontrollpunkte" height="26" src="../images/Points on.png" width="26" /></h3>
<p>W&#xE4;lder haben dieselben <em>Kontrollpunkte</em> wie die zu ihrer Erzeugung verwendeten Kurven, ohne R&#xFC;cksicht auf die Zahl der Pflanzenelemente oder ihre Position.</p>
<p>Zuz&#xFC;glich haben sie einen Kontrollpfeil zum Verschieben des gesamten Waldobjekts.</p>
<p>Wald-Kontrollpunkte werden bei der Einzelauswahl von W&#xE4;ldern automatisch aktiviert. Um einen oder mehrere Wald-Kontrollpunkte zu aktivieren, w&#xE4;hlen Sie einfach die W&#xE4;lder aus und starten Sie den Befehl <strong>PunkteEin</strong> (oder dr&#xFC;cken Sie F10).  Um die Punkte zu deaktivieren, dr&#xFC;cken Sie ESC oder starten Sie den Befehl <strong>PunkteAus</strong>.</p>


<div class="figureWithDescription block"><img src="../images/Commands/Forest/Forest control points.jpg" alt="Kontrollpunkte auf W&#xE4;ldern" /><br/>
Kontrollpunkte auf W&#xE4;ldern</div>
<br clear="all" />

<a name="Parameters" />
<h3>Einf&#xFC;gungsoptionen und -parameter</h3>
<p>Die W&#xE4;lder-Einf&#xFC;gungsoptionen und -Parameter sind in unterschiedliche Reiter aufgeteilt und &#xFC;ber verschiedene Dialoge abrufbar:</p>
<ul>
	<li>Wald-<a href="Interface_Dialog.html">Einf&#xFC;gungsdialog</a> (nur beim Einf&#xFC;gen eines neuen Waldes verf&#xFC;gbar).</li>
	<li>Abschnitt der Waldeigenschaften, im <a href="Interface_Panel.html">Lands-Design-Bearbeitungspanel</a>. </li>
	<li>Wald-<a href="Interface_Properties.html">Objekteigenschaftendialog</a>.</li>
</ul>

<h4>Allgemein</h4> 
<p>Allgemeine Attribute f&#xFC;r das Waldobjekt: <em>Name</em>, <em>Farbe</em>, <em>
Code</em> und <em>Stichw&#xF6;rter</em>.</p>

<a name="Forest" />
<h4>Wald</h4> 
<p>Zum Anordnen der Pflanzen in W&#xE4;ldern sind zwei Optionen verf&#xFC;gbar:</p>
<ul>
	<li><strong>Anzahl Einheiten</strong>: zur willk&#xFC;rlichen Verteilung einer Gesamtmenge von Pflanzenelementen innerhalb der Begrenzungskurve. Sie k&#xF6;nnen den <strong>Minimalen Abstand</strong> zwischen Pflanzenelementen festlegen. Die willk&#xFC;rliche Verteilung k&#xF6;nnen Sie &#xE4;ndern im Bearbeitungsbereich des Bedienfelds: Wald &gt; Neu verteilen. </li>
	<li><strong>Anordnung</strong>: ordnet die Pflanzenarten in Kolonnen und Reihen an.
	<ul>
		<li>Abstand: quadratisch, rechteckig, gleichseitiges und gleichschenkliges Dreieck.</li>
		<li>Drehung: das gesamte Waldobjekt dreht sich um seinen Mittelpunkt.</li>
		<li>Streuung: verschiebt die Pflanzenarten von den Anordnungs-Rasterpunkten.</li>
	</ul></li>
	
</ul>

<p>W&#xE4;lder k&#xF6;nnen unterschiedliche Pflanzenarten kombinieren:</p>

<ul>
	<li><strong>Anzahl Elemente</strong>: Geben Sie die Anzahl verschiedener Pflanzenarten ein. Die Liste verschiedener Arten wird in der <a href="Interface_Panel.html#List">Liste zur Objektauswahl</a> im <a href="Interface_Panel.html">
	Lands-Bearbeitungspanel</a> erscheinen, wo sie zur Bearbeitung ihrer Parameter ausgew&#xE4;hlt werden k&#xF6;nnen.</li>
	<li><strong>Verteilung</strong>: Optionen zum Verteilen der Pflanzenarten wenn mehr als ein Typ vorhanden ist.</li>
</ul>

<p>Eingef&#xFC;gte Einheiten: zeigt die genaue Anzahl von Pflanzeneinheiten im Wald an. Wenn der Wald im Modus <em>Anzahl Einheiten</em> angeordnet ist, richtet sich die gesamte Anzahl von Pflanzeneinheiten nach dem dazwischenliegenden minimalen Abstand.</p>

<a name="Plant" />
<h4>Pflanze</h4> 
	<ul>
		<li><strong>Art</strong>: Der Name der ausgew&#xE4;hlten Pflanzenart. Die Zusammenstellung zeigt eine Liste der verschiedenen Pflanzenarten an, die bereits im aktuellen Modell eingesetzt wurden. Sie k&#xF6;nnen eine Pflanzenart aus der Liste ausw&#xE4;hlen, oder aber eine neue aus der Pflanzendatenbank, wof&#xFC;r Sie auf die Schaltfl&#xE4;che <em>Durchsuchen...</em> klicken.</li>
		<li><strong>Bema&#xDF;ungen in der Zeichnung</strong>:
			<ul>
				<li>Kronendurchmesser</li>
				<li>Ungef&#xE4;hre H&#xF6;he</li>
				<li>Alter</li>
			</ul>
		</li>
		<li><strong>Nat&#xFC;rliche Variation</strong>: wenn sie aktiviert ist, setzt diese Option eine willk&#xFC;rliche H&#xF6;henvariation f&#xFC;r Pflanzenarten im Wald. Der Maximalwert (100 %) erzeugt Pflanzenarten, die von 50 % bis zu 150 % ihrer Gr&#xF6;&#xDF;e reichen.</li>
		<li><strong>Willk&#xFC;rliche Drehung</strong>: wenn sie aktiviert ist (Standard), stellt diese Option eine willk&#xFC;rliche Drehung der Pflanzen ein. Ist sie deaktiviert, k&#xF6;nnen Sie f&#xFC;r jede Pflanze einen spezifischen Drehwinkel definieren. Der Drehwinkel wird von der vertikalen Pflanzenachse aus gemessen.</li>

	
	</ul>
<p>Die minimalen und maximalen Werte der Pflanzenh&#xF6;he (Alter der Pflanze) werden durch die Eigenschaften jeder Pflanzenart definiert und k&#xF6;nnen im <a href="Commands_laPlantDataBase.html#Properties">Eigenschaftendialog der Pflanzenarten</a> bearbeitet werden, der in der Pflanzendatenbank verf&#xFC;gbar ist.</p>

<a name="Format" />
<h4>Format</h4> 

<li><strong>Kaliber</strong>: Rindenbema&#xDF;ung der Pflanzenart. Die verf&#xFC;gbaren Werte reichen von 10 bis 130 mm, Sie k&#xF6;nnen aber auch jeden sonstigen Wert eingeben.</li>
<li><strong>Darstellungsmodus</strong>: verf&#xFC;gbar sind drei Darstellungsmodi, Sie k&#xF6;nnen aber auch neue eingaben.
			<ul>
				<li>Nackte Wurzel</li>
				<li>Wurzelballen</li>
				<li>Beh&#xE4;lter</li>
			</ul>
</li>


<a name="Render" />
<h4>Rendern</h4> 
<p>Dieser Reiter bestimmt, wie Pflanzenarten in W&#xE4;ldern in einer Renderdarstellung aussehen. Sichtbar ist dieser Reiter nur, wenn die 3D-Darstellung der Pflanzen in den Dokumenteigenschaften auf Realistisch eingestellt ist.</p>

<ul>
	<li><strong>Jahreszeit</strong>: wenn das K&#xE4;stchen Globale Jahreszeit ignorieren markiert ist, k&#xF6;nnen Sie ausw&#xE4;hlen, in welcher Jahreszeit die Pflanzen gerendert werden, wobei Sie aus 7 vorhandenen Werten ausw&#xE4;hlen k&#xF6;nnen: Vorfr&#xFC;hling, Fr&#xFC;hling, Sp&#xE4;tfr&#xFC;hling, Sommer, Sp&#xE4;tsommer, Herbst, Winter...</li>
	<li><strong>Laubdichte</strong>: Je nach Definition erzeugt Flamingo nXt mehr oder weniger Bl&#xE4;tter.</li>
</ul>


<a name="Edit" />
<h3>Bearbeitungsoptionen</h3>
<p>Dies sind die Bearbeitungsoptionen f&#xFC;r das Waldobjekt, verf&#xFC;gbar im <a href="Interface_Panel.html#Edit">Bearbeitungsbereich des Bearbeitungsfensters</a>:</p>
<ul>
	<li><img alt="Aktualisieren" height="24" src="../images/Icon/laUpdate.png" width="24" /><a href="Commands_laUpdate.html">Aktualisieren</a></li>
	<li><img alt="laGruppierungAufheben" height="24" src="../images/Icon/laUngroup.png" width="24" /> <a href="Commands_laUngroup.html">Gruppierung aufheben</a></li>
	<li><a href="Commands_laCopyFrom.html">Eigenschaften von einem anderen Objekt kopieren</a>.</li>
		
	<li>Anpassen
		<ul>
		<li><img alt="laErh&#xF6;hen" height="24" src="../images/Icon/laElevate.png" width="24" /> <a href="Commands_laElevate.html">Erh&#xF6;hung</a></li>
		<li><img alt="laAufNullErh&#xF6;hen" height="24" src="../images/Icon/laElevateToZero.png" width="24" /> <a href="Commands_laElevateToZero.html">Auf Nullh&#xF6;he</a></li>
		<li><img alt="AufGel&#xE4;ndeErh&#xF6;hen" height="24" src="../images/Icon/laElevateToTerrain.png" width="24" /> <a href="Commands_laElevateToTerrain.html">
		An Gel&#xE4;nde</a></li>
		</ul>
	</li>
	<li>Nicht an Gel&#xE4;nde anpassen</li>
	<li>Wald
		<ul>
		    <li>Neu verteilen</li>
			<li>&#xD6;ffnung hinzuf&#xFC;gen: Befehl zum Abziehen einer Begrenzung vom Wald</li>
			<li><a href="Commands_laRandomize.html">Zuf&#xE4;lligFestlegen</a></li>
		</ul>
	</li>
	<li>Pflanze
		<ul>
			<li><img alt="laPflanzeArtBearbeiten" height="24" src="../images/Icon/laEdit.png" width="24" /> <a href="Commands_laPlantEditSpecies.html">Art bearbeiten</a></li>
		    <li><img alt="laPflanzenetikett" height="24" src="../images/Icon/laPlantLabel.png" width="24" /> <a href="Commands_laPlantLabel.html">Etikett</a>. <em>(Dieser Befehl erscheint nur, wenn den Pflanzen im Wald kein Etikett zugewiesen wurde.)</em></li> 
			<li><img alt="laPflanzenetikettAusw&#xE4;hlen" height="24" src="../images/Icon/laPlantSelectLabel.png" width="24" /> <a href="Commands_laplantSelectLabel.html">
			Etikett erkennen</a> <em>(Dieser Befehl erscheint nur, wenn es ein die Pflanzenart im Waldobjekt referenzierendes <a href="Commands_laPlantLabel.html">Pflanzenetikett</a> gibt.)</em></li>
			<li><img alt="laPflanzenfoto" height="24" src="../images/Icon/laPlantPhoto.png" width="24" /> <a href="Commands_laPlantPhoto.html">Foto einf&#xFC;gen</a></li>
		</ul>
	</li>
</ul>

<a name="Display" />
<h3>Grafische Walddarstellung:</h3>
<p>Pflanzenarten in W&#xE4;ldern <a href="Commands_laPlant.html#Display">werden grafisch genauso dargestellt wie Pflanzenarten</a> die einzeln eingef&#xFC;gt wurden. Die grafische Darstellung von Pflanzenarten in W&#xE4;ldern kann in den <a href="Interface_DocumentProperties.html">Dokumenteigenschaften</a> ge&#xE4;ndert werden.</p>
