<h3>Zaun</h3>
<div class="comDescr">
	<div class="field"><strong>Wo befindet sich dieser Befehl?</strong></div>
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laZaun</div>
	
	<div class="field">Symbol: </div>
	<div class="value icon"><img src="../images/Icon/laFence.png" alt="Zaun"/> Linksklick

	</div>
	
	<div class="field"><a href="Interface_Toolbars.html#CivilWorkToolbar">Werkzeugleiste: Lands-Objekte</a></div>
	<div class="value toolbar"><img src="../images/Toolbar/Civil Work Toolbar.png" alt="Bau-Befehle" usemap ="#CivilWorkToolbarMap" /></div>
	
	<div class="field"><a href="Interface_Drop-down.html">Men&#xFC;</a>: </div>
	<div class="value menu">Lands Design &gt; Bau &gt; Zaun</div>
</div>

<p>Z&#xE4;une sind Elemente die dazu verwendet werden, einen Garten oder Park in Bereiche f&#xFC;r verschiedene Verwendungszwecke zu unterteilen. </p>
<p>Z&#xE4;une werden von einer Kombination aus drei Komponenten bestimmt, die jederzeit hinzugef&#xFC;gt oder gel&#xF6;scht werden k&#xF6;nnen: <strong>Pfosten</strong>, <strong>Planken</strong> und <strong>Gel&#xE4;nder</strong>.</p>

<ul>
	<li><a href="Commands_laFence.html#Insert">Einen Zaun einf&#xFC;gen</a></li>
	<li><a href="Commands_laFence.html#ControlPoints">Kontrollpunkte</a></li>
	<li><a href="Commands_laFence.html#Parameters">Einf&#xFC;gungsoptionen und -parameter</a></li>
	<li><a href="Commands_laFence.html#Edit">Bearbeitungsoptionen</a></li>
	<li><a href="Commands_laFence.html#Display">Graphische Darstellung</a></li>

</ul>
<a name="Insert" />
<h3>Einen Zaun einf&#xFC;gen:</h3>
<p>Durch Ausf&#xFC;hren des Befehls <strong>laZaun</strong> wird der <a href="Interface_Dialog.html">Einf&#xFC;gedialog</a> f&#xFC;r Z&#xE4;une ge&#xF6;ffnet. Dieser Dialog zeigt die grundlegenden Optionen des Zaunobjekts auf zwei Reitern an.</p>
<ul>
<li><a href="Commands_laFence.html#Fence">Zaun</a>: Zaunparameter.</li>
<li><a href="Commands_laFence.html#Post">Pfosten</a>: Parameter der Pfostenkomponente.</li>
<li><a href="Commands_laFence.html#Baluster">Planke</a>: Parameter der Plankenkomponente.</li>
<li><a href="Commands_laFence.html#Material">Material</a>: Materialeinstellungen f&#xFC;r das Zaunobjekt.</li>
</ul>

<p><strong>Vorgehen:</strong></p>
<ol>
	<li>W&#xE4;hlen Sie die <strong>Zaunparameter</strong>. Klicken Sie auf OK, um das Dialogfeld zu schlie&#xDF;en</li>
	<li>W&#xE4;hlen Sie eine im Modell vorhandene <strong>Kurve</strong> aus, um den Zaunpfad zu definieren, oder w&#xE4;hlen Sie eine unterschiedliche Option in der Befehlszeile.
		<ul>
			<li><strong>Polylinie</strong>: der Zaun wird so erzeugt, als ob Sie eine Polylinie zeichnen w&#xFC;rden.</li>
			<li><strong>Spline</strong>: das Zaun wird so erzeugt, als ob Sie einen Spline zeichnen w&#xFC;rden.</li>
			<li><strong>Kreis</strong>: das Zaun wird so erzeugt, als ob Sie einen Kreis zeichnen w&#xFC;rden. Mit dem ersten Klick wird die Kreismitte bestimmt, und mit dem zweiten Klick der Radius.</li>
			<li><strong>Bogen</strong>: das Zaun wird so erzeugt, als ob Sie einen Bogen zeichnen w&#xFC;rden. Mit dem ersten Klick wird der Einf&#xFC;gungspunkt bestimmt. Der zweite Klick bestimmt einen Mittelpunkt im Bogen. Mit dem dritten und letzten Klick wird bestimmt, wo der Bogen endet.</li>
			<li><strong>Rechteck</strong>: das Zaun wird so erzeugt, als ob Sie ein Rechteck zeichnen w&#xFC;rden. Mit dem ersten Klick wird eine Ecke des Rechtecks bestimmt, und mit dem zweiten Klick die gegen&#xFC;berliegende Ecke. </li>
		</ul>
	</li>
	<li>Beenden Sie den Befehl durch Dr&#xFC;cken von Eingabe, Esc oder Klicken auf die rechte Maustaste.</li>
</ol>
<p>Lands verwendet die zur Vervollst&#xE4;ndigung der L&#xE4;nge der Zaunachse n&#xF6;tige Anzahl Pfosten und Planken, wobei die zuvor beschriebenen Parameter f&#xFC;r Abstand und Anzahl so weit wie m&#xF6;glich ber&#xFC;cksichtigt werden.</p>

<p><strong>Hinweis</strong>: Um einen Zaun zu bauen, m&#xFC;ssen nicht immer alle drei Komponenten gleichzeitig verwendet werden. Pfosten und Planken k&#xF6;nnen jedoch nicht gleichzeitig weggelassen werden.</p>

<p class="figureWithDescription"><img src="../images/commands/Fence/Fence Insert Dialog.png" alt="Einf&#xFC;gedialog f&#xFC;r den Zaun."/><br/>
Einf&#xFC;gedialog f&#xFC;r das Zaunobjekt.
</p><br/>
<br clear="all" />

<a name="ControlPoints" />
<h3>Kontrollpunkte <img alt="Kontrollpunkte" height="26" src="../images/Points on.png" width="26" /></h3>
<p>Das Zaunobjekt hat genauso viele <em>Kontrollpunkte</em> wie die Kurven, aus denen es erzeugt wurde.</p>
<p>Zus&#xE4;tzlich hat es einen Kontrollpfeil zum Verschieben des gesamten Objekts.</p>

<p>Zaun-Kontrollpunkte werden bei der Einzelauswahl der Z&#xE4;une automatisch aktiviert. Um einen oder mehrere Zaun-Kontrollpunkte zu aktivieren, w&#xE4;hlen Sie einfach die Z&#xE4;une aus und starten Sie den Befehl <strong>PunkteEin</strong> (oder dr&#xFC;cken Sie F10). Um die Punkte eines Zaunobjekts zu deaktivieren, dr&#xFC;cken Sie ESC oder starten Sie den Befehl <strong>PunkteAus</strong>. </p>





<div class="figureWithDescription block"><img src="../images/Commands/Fence/Fence Control Points.jpg" alt="Kontrollpunkte auf Z&#xE4;unen" /><br/>
Kontrollpunkte auf Zaunobjekten</div>
<br clear="all" />


<a name="Parameters" />
<h3>Einf&#xFC;gungsoptionen und -parameter</h3>
<p>Die Zaunobjekt-Einf&#xFC;gungsoptionen und -Parameter sind in unterschiedliche Reiter aufgeteilt und &#xFC;ber verschiedene Dialoge abrufbar:</p>
<ul>
	<li>Zaun-<a href="Interface_Dialog.html">Einf&#xFC;gungsdialog</a> (nur beim Einf&#xFC;gen neuer Z&#xE4;une verf&#xFC;gbar).</li>
	<li>Abschnitt der Zauneigenschaften, im <a href="Interface_Panel.html">Lands-Design-Bearbeitungspanel</a>.</li>
	<li>Zaun-<a href="Interface_Properties.html">Objekteigenschaftendialog</a>.</li>
</ul>

<h4>Allgemein</h4> 
<p>Allgemeine Attribute f&#xFC;r das Zaunobjekt: <em>Name</em>, <em>Farbe</em>, <em>Code</em> und <em>Stichw&#xF6;rter</em>.</p>

<a name="Fence" />
<h4>Zaun</h4> 
<p>Dieser Zaun erm&#xF6;glicht Ihnen die Bearbeitung der allgemeinen Parameter der Zaunkomponenten: Pfosten, Planken und Gel&#xE4;nder.
<ul>
	<li><strong>Pfosten</strong>: dies sind die prim&#xE4;ren vertikalen Komponenten eines Zauns. Sie befinden sich jeweils am Start- und Endpunkt einer Zaunkurve sowie an jedem der Unstetigkeitspunkte dazwischen. Sie k&#xF6;nnen auf zwei Arten verteilt werden:
		<ul>
			<li><strong>Abstand zwischen Pfosten</strong>: Abstand zwischen Pfosten wenn keine Unstetigkeitspunkte dazwischenliegen. Dieser Parameter wirkt sich auf den Parameter der Pfosten-<em>Anzahl</em> aus, der automatisch berechnet wird.</li>
			<li><strong>Nach Anzahl der Planken</strong>: der Abstand zwischen Pfosten wird durch die Einstellung der Pfosten-Anzahl bestimmt. Diese Option ist nur verf&#xFC;gbar, wenn die Planken-Komponente ausgew&#xE4;hlt ist.</li>

	</ul>

	</li>

	<li><strong>Planken</strong>: vertikale Elemente zwischen den Zaunpfosten.
		<ul>
			<li><strong>Trennung</strong>: L&#xFC;cke zwischen Planken wenn keine Unstetigkeitspunkte dazwischenliegen.</li>
			<li><strong>Anzahl</strong>: Anzahl Planken zwischen zwei Pfosten. Diese Zahl ist im letzten Teil des Zauns, oder auch in zu kurzen Zaunsegmenten, m&#xF6;glicherweise nicht effektiv.</li>
			<li><strong>H&#xF6;he vom Boden</strong>: Abstand zwischen der Planken-Unterkante und der Zaunpfadkurve Mit der Option <strong>Zentriert</strong> werden die Planken vertikal zentriert, mit der Pfostenh&#xF6;he als Referenzwert.</li>
		</ul>
	</li>
	
	<li><strong>Gel&#xE4;nder</strong>: horizontale Zaunelemente, die der Zaunpfadkurve folgen.
		<ul>
			<li><strong>Profil</strong>: anders als Pfosten und Planken k&#xF6;nnen Gel&#xE4;nder nur ein rechteckiges Profil haben.</li>
			<li><strong>Anzahl</strong>: Zahl der Gel&#xE4;nderelemente im Zaun.</li>
			<li><strong>Trennung</strong>: Abstand zwischen Z&#xE4;unen. Die Option 
			<strong>Gleichm&#xE4;&#xDF;ig verteilt</strong> definiert einen gleichen Trennungsabstand zwischen Gel&#xE4;nderelementen.</li>
			<li><strong>H&#xF6;he vom Boden</strong>: Abstand zwischen dem unteren Gel&#xE4;nderelement und der Zaunpfadkurve. Mit der Option <strong>Zentriert</strong> werden die Gel&#xE4;nder vertikal zentriert, mit der Pfostenh&#xF6;he als Referenzwert. </li>
			<li><strong>Ausrichtung</strong>: Position von Gel&#xE4;ndern (<em>Links, Mitte, Rechts</em>) bez&#xFC;glich der Pfosten- und Plankenkomponente.</li>
		</ul>
	</li>
</ul>
</p>	
<a name="Post" />
<h4>Pfosten</h4> 
<p>Dieser Reiter erscheint wenn die Pfostenkomponente auf dem Reiter <em>Zaun</em> aktiviert ist. Folgende Parameter k&#xF6;nnen definiert werden:

	<ul>
		<li><strong>Objektauswahl</strong>: Sie k&#xF6;nnen die Geometrie f&#xFC;r die Pfosten auf verschiedene Weisen ausw&#xE4;hlen:
			<ul>
				<li><img src="../images/BlockLibraryButton.png" alt="Auswahl aus Blockbibliothek"/> Ein Block aus der Blockbibliothek.</li>
				<li><img src="../images/BrowseButton.png" alt="Auswahl von PC"/> Eine Datei aus Ihrem PC</li>
				<li><img src="../images/SelectButton.png" alt="Auswahl im Modell"/> Ein im Modell vorhandenes Objekt.</li>
			</ul>
		</li>
		<li><strong>Bema&#xDF;ungen</strong>: die Pfostenbema&#xDF;ungen werden automatisch aus der ausgew&#xE4;hlten Geometrie berechnet (entsprechend ihrer H&#xFC;llk&#xF6;rper-Bema&#xDF;ungen). Sie k&#xF6;nnen diese Bema&#xDF;ungen &#xE4;ndern und das Objekt wird entsprechend skaliert.
			<ul>
				<li><em>Gleichm&#xE4;&#xDF;ige Skalierung</em>: mit dieser Option &#xE4;ndern sich die Pfostenbema&#xDF;ungen automatisch mit der Bearbeitung ihrer Werte, welcher auch immer, um die Proportionen der Komponenten beizubehalten.</li>
			</ul>
		</li>
		
	</ul>
</p>

<a name="Baluster" />
<h4>Planke</h4> 
<p>Dieser Reiter erscheint wenn die Plankenkomponente auf dem Reiter <em>Zaun</em> aktiviert ist. Folgende Parameter k&#xF6;nnen definiert werden:
<ul>
		<li><strong>Objektauswahl</strong>: Sie k&#xF6;nnen die Geometrie f&#xFC;r die Planke auf verschiedene Weisen ausw&#xE4;hlen:
			<ul>
				<li><img src="../images/BlockLibraryButton.png" alt="Auswahl aus Blockbibliothek"/> Ein Block aus der Blockbibliothek.</li>
				<li><img src="../images/BrowseButton.png" alt="Auswahl von PC"/> Eine Datei aus Ihrem PC</li>
				<li><img src="../images/SelectButton.png" alt="Auswahl im Modell"/> Ein im Modell vorhandenes Objekt.</li>
			</ul>
		</li>
		<li><strong>Bema&#xDF;ungen</strong>: die Plankenbema&#xDF;ungen werden automatisch aus der ausgew&#xE4;hlten Geometrie berechnet (entsprechend ihrer H&#xFC;llk&#xF6;rper-Bema&#xDF;ungen). Sie k&#xF6;nnen diese Bema&#xDF;ungen &#xE4;ndern und das Objekt wird entsprechend skaliert.
			<ul>
				<li><em>Gleichm&#xE4;&#xDF;ige Skalierung</em>: mit dieser Option &#xE4;ndern sich die Plankenbema&#xDF;ungen automatisch mit der Bearbeitung ihrer Werte, welcher auch immer, um die Proportionen der Komponenten beizubehalten.</li>
			</ul>
		</li>
</ul>
</p>

<a name="Material" />
<h4>Material</h4>
<p>Mit diesem Reiter k&#xF6;nnen Sie das diesem Element zugewiesene texturierte Bild &#xE4;ndern und Bildgr&#xF6;&#xDF;e, Reflexionsverm&#xF6;gen und Transparenz definieren.</p>
<p>Pfosten- und Plankenkomponenten &#xFC;bernehmen das Zaunmaterial, wenn das Material ihren Bestandteilen <em>Nach &#xFC;bergeordnet</em> zugewiesen ist.</p>

<a name="Edit" />
<h3>Bearbeitungsoptionen</h3>
<p>Dies sind die Bearbeitungsoptionen f&#xFC;r das Zaunobjekt, verf&#xFC;gbar im <a href="Interface_Panel.html#Edit">Bearbeitungsbereich des Bearbeitungsfensters</a>:</p>
<ul>
	<li><img alt="Aktualisieren" height="24" src="../images/Icon/laUpdate.png" width="24" /> <a href="Commands_laUpdate.html">Aktualisieren</a></li>
	<li><img alt="In 2D umwandeln" height="24" src="../images/Icon/laConvertTo2D.png" width="24" /> <a href="Commands_laConvertTo.html">In 2D umwandeln</a>. Zeigt das Objekt in der 2D-Darstellung an.</li>
	<li><img alt="In 3D umwandeln" height="24" src="../images/Icon/laConvertTo3D.png" width="24" /> <a href="Commands_laConvertTo.html">In 3D umwandeln</a>. Zeigt das Objekt in der 3D-Darstellung an.</li>
	<li><a href="Commands_laConvertTo.html">2D und 3D anzeigen</a>: Aktiviert gleichzeitig die 2D- und 3D-Darstellung des Objekts. </li>


	<li><a href="Commands_laCopyFrom.html">Eigenschaften von einem anderen Objekt kopieren</a></li>
	<li><a href="Commands_laCopyToCurve.html">Auf eine andere Kurve kopieren</a></li>
	<li><a href="Commands_laReverseCurve.html">Kurve umkehren</a></li>
	<li><a href="Commands_laExtractCurves.html">Kurve extrahieren</a></li>
	
	<li>Anpassen
		<ul>
		<li><img alt="laErh&#xF6;hen" height="24" src="../images/Icon/laElevate.png" width="24" /> <a href="Commands_laElevate.html">Erh&#xF6;hung</a></li>
		<li><img alt="laAufNullErh&#xF6;hen" height="24" src="../images/Icon/laElevateToZero.png" width="24" /> <a href="Commands_laElevateToZero.html">Auf Nullh&#xF6;he</a></li>
		<li><img alt="AufGel&#xE4;ndeErh&#xF6;hen" height="24" src="../images/Icon/laElevateToTerrain.png" width="24" /> <a href="Commands_laElevateToTerrain.html">
		An Gel&#xE4;nde</a></li>
		</ul>
	</li>
	<li>Nicht an Gel&#xE4;nde anpassen</li>
	
</ul>

<a name="Display"></a>
<h3>Grafische Zaundarstellung</h3>
<p>Das Zaunobjekt bietet eine gleichzeitige 2D- und 3D-Darstellung der Zeichnung.</p>

<table>
<tbody>
	<tr>
		<td>
			<div class="figureWithDescription block"><img src="../images/Commands/Fence/Fence 2D.jpg" alt="2D-Darstellung"/>
 </div>
		</td>
		<td>
			<div class="figureWithDescription block"><img src="../images/Commands/Fence/Fence 3D.jpg" alt="3D-Darstellung"/>
 </div>
		</td>
	</tr>
	<tr>
		<td align="center" width="200px">2D</td>
		<td align="center" width="200px">3D</td>
	</tr>
</tbody>
 </table>