<h3>Erdscan</h3>
<div class="comDescr">
	<div class="field"><strong>Wo befindet sich dieser Befehl?</strong></div>
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laEarthScan</div>
	
	<div class="field">Symbol: </div>
	<div class="value icon"><img src="../images/Icon/laEarthScan.png" alt="H&#xF6;hendaten importieren"/> Linksklick

	</div>
	
	<div class="field">Werkzeugleiste: <a href="Interface_Toolbars.html#TerrainToolbar">Lands-Gel&#xE4;nde</a></div>
	<div class="value toolbar"><img src="../images/Toolbar/Terrain Toolbar.png" alt="Gel&#xE4;nde-Befehle" usemap ="#TerrainToolbarMap" /></div>
	
	<div class="field"><a href="Interface_Drop-down.html">Men&#xFC;</a>: </div>
	<div class="value menu">Lands Design &gt; Gel&#xE4;ndemodellierung &gt; H&#xF6;hendaten importieren</div>
</div>

<p>Mit diesem Befehl wird ein Gel&#xE4;nde aus der Cloud gescannt und als texturiertes Polygonnetz oder Gel&#xE4;ndeobjekt importiert.</p>

<p>Nach Ausf&#xFC;hren des Befehls <strong>laEarthScan</strong> erscheint der Dialog <strong>H&#xF6;hendaten importieren</strong>.</p>

<p class="figureWithDescription"><img src="../images/commands/Terrain/EarthScanDialog.png" alt="Dialog H&#xF6;hendaten importieren"/><br/>
Dialog H&#xF6;hendaten importieren.
</p>

<p>Dieser Dialog ist in zwei Teile geteilt. Ein Bereich zum Navigieren &#xFC;ber der Erde und die Import-Einstellungen.</p>
<p> Klicken Sie im Navigationsbereich auf die linke obere Schaltfl&#xE4;che, um zwischen 4 verschiedenen Kartenmodi hin- und herzuschalten (Stra&#xDF;en, Au&#xDF;enfl&#xE4;chen, Satellit und Satellitenstra&#xDF;en) oder verwenden Sie das Feld <em>Suchen</em> um einen bestimmten Ort auf der Welt zu finden.</p>
<p>Die Einstellungen k&#xF6;nnen mit der <em>Pfeil</em>-Schaltfl&#xE4;che im unteren Bereich der Einstellungen zusammengefaltet werden.</p>


<p><strong>Vorgehen:</strong></p>
<ol>
<li><b>Navigieren Sie &#xFC;ber den Bereich der Erde</b> den Sie importieren m&#xF6;chten. Der Bereich hinter den Einstellungen wird ebenfalls mit einbezogen. Verwenden Sie die Pfeile, um die Karte exakt Frame f&#xFC;r Frame auf gleicher H&#xF6;he zu scrollen. Der Bereich ist auf eine Ausdehnung von 10 Km entlang jeder Seite des Navigationsbereichs beschr&#xE4;nkt, ansonsten k&#xF6;nnen die H&#xF6;hendaten nicht importiert werden.</li>
<li>W&#xE4;hlen Sie beim Import die <b>Geometrieerzeugung</b> aus:
	<ul>
		<li><b>Polygonnetz erzeugen</b>: ein texturiertes Polygonnetz, das mit dem Bild des gescannten Bereichs als Gel&#xE4;nde etikettiert ist, wird erzeugt.</li>
		<li><b>Gel&#xE4;nde erzeugen</b>: mit den gescannten H&#xF6;hedaten wird automatisch ein Gel&#xE4;nde erzeugt.</li>
	</ul>
</li>
<li><strong>Geolokalisieren</strong> Sie das Dokument. Beim erstmaligen Importieren wird die Bildmitte auf den Koordinaten (0,0,0) platziert. Dies stimmt nach Breitengrad, L&#xE4;ngengrad und H&#xF6;he mit der Modellposition &#xFC;berein. Bei einem zweiten Import k&#xF6;nnen Sie w&#xE4;hlen, ob Sie die urspr&#xFC;nglichen Koordinaten des Erstimports beibehalten oder sie mit der neu importierten Kartenmitte &#xFC;berschreiben wollen.
</li>


<li>W&#xE4;hlen der <b>H&#xF6;hendaten</b>: w&#xE4;hlen Sie die Genauigkeit der zu scannenden Samples nach einem Werte-Intervall (0-100) oder nach einem bestimmten Abstand zwischen den Samples. Anhand der ausgew&#xE4;hlten Werte wird die zum Import ben&#xF6;tigte Anzahl Samples berechnet, welche auf 50000 pro Import beschr&#xE4;nkt ist.</li>
				
<li>Klicken Sie auf die Schaltfl&#xE4;che <kbd>Importieren</kbd> um die ausgew&#xE4;hlten Daten zu importieren. (Klicken Sie auf die Schaltfl&#xE4;che <kbd>Zur&#xFC;cksetzen</kbd> um die Originaleinstellungen wiederherzustellen).</li>
</ol>

<p><b>HINWEIS 1</b>: Die allgemeine Genauigkeit der aus der Cloud bezogenen Daten betr&#xE4;gt fast ein Sample alle 30 Meter. Wenn Sie in den Einstellungen der H&#xF6;hendaten einen kleineren Wert festlegen, erzeugt Lands automatisch die interpolierten Samples.</p>
<p><b>HINWEIS 2</b>: Sobald Sie das Gel&#xE4;nde importieren, aktivieren Sie den Anzeigemodus Gerendert, um das Bild auf dem importierten Polygonnetz zu sehen.</p>
