<h3>Gel&#xE4;nde L&#xFC;cke hinzuf&#xFC;gen</h3>
<div class="comDescr">
	<div class="field"><strong>Wo befindet sich dieser Befehl?</strong></div>
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laGel&#xE4;nde&#xD6;ffnungHinzuf&#xFC;gen</div>
	
	<div class="field">Symbol: </div>
	<div class="value icon"><img src="../images/Icon/laTerrainAddHole.png" alt="Gel&#xE4;nde L&#xFC;cke hinzuf&#xFC;gen"/> Linksklick

	</div>
	
	<div class="field">Werkzeugleiste: <a href="Interface_Toolbars.html#TerrainToolbar">Lands-Gel&#xE4;nde</a></div>
	<div class="value toolbar"><img src="../images/Toolbar/Terrain Toolbar.png" alt="Gel&#xE4;nde-Befehle" usemap ="#TerrainToolbarMap" /></div>
	
	<div class="field"><a href="Interface_Drop-down.html">Men&#xFC;</a>: </div>
	<div class="value menu">Lands Design &gt; Gel&#xE4;ndemodellierung &gt; Gel&#xE4;nde &gt; L&#xFC;cke hinzuf&#xFC;gen</div>
	
	<div class="field"><a href="Interface_Panel.html">Bearbeitungspanel</a>: </div>
	<div class="value menu">Ein Gel&#xE4;nde ausw&#xE4;hlen &gt; Bearbeitungsbereich im Bearbeitungspanel &gt; Gel&#xE4;nde &gt; L&#xFC;cke hinzuf&#xFC;gen</div>
</div>


<p>&#xD6;ffnungen oder L&#xFC;cken sind Durchbr&#xFC;che im Gel&#xE4;nde, um zum Beispiel ein Schwimmbecken, einen Teich oder einen See einzuf&#xFC;gen. Die &#xD6;ffnungen werden anhand einer beliebigen geschlossenen Kurve berechnet, die zur Eingrenzung des zu entfernenden Bereichs verwendet wird. Die H&#xF6;henposition der Kurve bestimmt die Tiefe des Lochs.</p>
<p>Diese Operation f&#xFC;gt dem Gel&#xE4;nde auch eine Teilung aus der gleichen geschlossenen Kurve hinzu, so als ob Sie den Befehl <a href="Commands_laTerrainDivide.html">laGel&#xE4;ndeUnterteilen</a> verwenden w&#xFC;rden.</p>

<p><strong>Vorgehen:</strong></p>

<ol>
 <li>W&#xE4;hlen Sie ein <strong>Gel&#xE4;nde</strong>. Dann dr&#xFC;cken Sie Eingabe oder klicken Sie auf die rechte Maustaste.</li>
  <li>W&#xE4;hlen Sie eine <strong>geschlossene Kurve</strong>.</li>
</ol>

<p>Die L&#xFC;cke wird im Gel&#xE4;nde erzeugt.</p>

<p class="figureWithDescription"><img src="../images/commands/Terrain/Add Hole 1.jpg" alt="Gel&#xE4;nde und die zum Erzeugen der L&#xFC;cke ausgew&#xE4;hlte Kurve"/><br/>
Gel&#xE4;nde und die zum Erzeugen der L&#xFC;cke ausgew&#xE4;hlte Kurve.
</p>

<p class="figureWithDescription"><img src="../images/commands/Terrain/Add Hole 2.jpg" alt="Gel&#xE4;nde mit erzeugter L&#xFC;cke"/><br/>
Gel&#xE4;nde mit erzeugter L&#xFC;cke.
</p>

<p><strong>Hinweis</strong>: Die L&#xFC;cke ist nicht wahrnehmbar wenn die Kurve &#xFC;ber dem Gel&#xE4;nde positioniert ist, d.h. ohne sich damit zu &#xFC;berschneiden.</p>



<a name="Parameters" />
<h3>Parameter</h3>

<p>Die L&#xFC;cke-Parameter k&#xF6;nnen im Reiter <em>Eingabedaten</em> bearbeitet werden (im <a href="Interface_Panel.html#Properties">Eigenschaftenbereich des Bearbeitungspanels</a> oder im <a href="Interface_Properties.html">Eigenschaftenexplorer-Dialog</a>), unter der <em>Erdbewegung</em>-Liste.</p>
<ul>
	<li><strong>Kontrollpunkte</strong>: Option zum Aktivieren oder Deaktivieren der Kontrollpunkte des Bereichs L&#xFC;cke (und Unterteilung).</li>
</ul>

<p>Die Bearbeitungsoptionen und -parameter der mit diesem Befehl erzeugten Gel&#xE4;ndeteilung sind die gleichen wie die mit dem Befehl <a href="Commands_laTerrainDivide.html">laGel&#xE4;ndeUnterteilen</a> erzeugten.</p>


<a name="ControlPoints" />
<h3>Kontrollpunkte <img alt="Kontrollpunkte" height="26" src="../images/Points on.png" width="26" /></h3>
<p>Die Kontrollpunkte f&#xFC;r die Gel&#xE4;ndel&#xFC;cke dienen zur &#xC4;nderung der &#xD6;ffnungsh&#xF6;he und der Begrenzungsfl&#xE4;che des &#xD6;ffnungsbodens. Sie sind die gleichen wie die der f&#xFC;r diese Operation verwendeten Kurven. Zus&#xE4;tzlich gibt es einen Kontrollpfeil zum Verschieben der gesamten &#xD6;ffnungsposition.</p>
<p>Diese Kontrollpunkte sind in das Gel&#xE4;nde integriert und werden bei Aktivierung der Gel&#xE4;nde-Kontrollpunkte sichtbar.</p>
<p>Sie k&#xF6;nnen im Reiter <em>Eingabedaten</em> deaktiviert werden (im <a href="Interface_Panel.html#Properties">Eigenschaftenbereich des Bearbeitungspanels</a> oder im <a href="Interface_Properties.html">Eigenschaftenexplorer-Dialog</a>), nach Auswahl der L&#xFC;cke unter der <em>Erdbewegung</em>-Liste.</p>


<p><strong>Hinweis</strong>: die durch eine L&#xFC;cke erzeugten Kontrollpunkte der Unterteilung sind von den Kontrollpunkten der L&#xFC;cke abh&#xE4;ngig, egal ob sie in den Unterteilungseinstellungen aktiviert sind oder nicht.</p>

