<h3>Gel&#xE4;nde Pfad hinzuf&#xFC;gen</h3>
<div class="comDescr">
	<div class="field"><strong>Wo befindet sich dieser Befehl?</strong></div>
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laGel&#xE4;ndePfadHinzuf&#xFC;gen</div>
	
	<div class="field">Symbol: </div>
	<div class="value icon"><img src="../images/Icon/laTerrainAddPath.png" alt="Gel&#xE4;nde Pfad hinzuf&#xFC;gen"/> Linksklick

	</div>
	
	<div class="field"><a href="Interface_Drop-down.html">Men&#xFC;</a>: </div>
	<div class="value menu">Lands Design &gt; Gel&#xE4;ndemodellierung &gt; Gel&#xE4;nde &gt; Pfad hinzuf&#xFC;gen</div>
	
	<div class="field"><a href="Interface_Panel.html">Bearbeitungspanel</a>: </div>
	<div class="value menu">Ein Gel&#xE4;nde ausw&#xE4;hlen &gt; Bearbeitungsbereich im Bearbeitungspanel &gt; Gel&#xE4;nde &gt; Pfad hinzuf&#xFC;gen</div>
</div>


<p>Dieser Befehl dient zur &#xC4;nderung der Gel&#xE4;ndegeometrie, damit ein Pfad eingef&#xFC;gt werden kann.</p>
<p>Diese Operation f&#xFC;gt dem Gel&#xE4;nde auch eine Teilung unter Verwendung der gleichen Pfadkurve und Pfadbreite hinzu, so als ob Sie den Befehl <a href="Commands_laTerrainDivide.html">laGel&#xE4;ndeUnterteilen</a> verwenden w&#xFC;rden.</p>

<p><strong>Vorgehen:</strong></p>

<ol>
	<li>W&#xE4;hlen Sie ein <strong>Gel&#xE4;nde</strong>. Dann dr&#xFC;cken Sie Eingabe oder klicken Sie auf die rechte Maustaste.</li>
	<li>Legen Sie die <strong>Pfadbreite</strong> fest.</li>
	<li>Bestimmen Sie einen <strong>Winkel</strong> f&#xFC;r die Neigung innerhalb des Intervalls (5 bis 85).</li>
    <li>W&#xE4;hlen Sie eine <strong>Kurve</strong> um den Pfadverlauf zu definieren.</li>
</ol>

<p>Im Gel&#xE4;nde wird das zur Anpassung an die Kurvenposition erforderliche Bodenvolumen hinzugef&#xFC;gt und entfernt, je nach gegebenem Neigungswinkel. </p>

<p class="figureWithDescription"><img src="../images/commands/Terrain/Add Path 1.jpg" alt="Gel&#xE4;nde vor der Hinzuf&#xFC;gung des Pfads"/><br/>
Gel&#xE4;nde vor der Hinzuf&#xFC;gung des Pfads.
</p>

<p class="figureWithDescription"><img src="../images/commands/Terrain/Add Path 2.jpg" alt="Gel&#xE4;nde nach der Hinzuf&#xFC;gung des Pfads"/><br/>
Gel&#xE4;nde nach der Hinzuf&#xFC;gung des Pfads.
</p>

<a name="Parameters" />
<h3>Parameter</h3>

<p>Die Gel&#xE4;ndepfad-Parameter k&#xF6;nnen im Reiter <em>Eingabedaten</em> bearbeitet werden (im <a href="Interface_Panel.html#Properties">Eigenschaftenbereich des Bearbeitungspanels</a> oder im <a href="Interface_Properties.html">Eigenschaftenexplorer-Dialog</a>), unter der <em>Erdbewegung</em>-Liste.</p>
<ul>
	<li><strong>Kontrollpunkte</strong>: Option zum Aktivieren oder Deaktivieren der Kontrollpunkte des Bereichs Pfad (und Unterteilung).</li>
	<li><strong>Pfadbreite</strong>: die Pfadbreite wird mit der Pfadkurve zentriert.</li>
	<li><strong>Neigungswinkel</strong>: Winkel, in dem das Gel&#xE4;nde entlang der Pfadkontur angepasst wird.</li>
</ul>

<p>Die Bearbeitungsoptionen und -parameter der mit diesem Befehl erzeugten Gel&#xE4;ndeteilung sind die gleichen wie die mit dem Befehl <a href="Commands_laTerrainDivide.html">laGel&#xE4;ndeUnterteilen</a> erzeugten.</p>


<a name="ControlPoints" />
<h3>Kontrollpunkte <img alt="Kontrollpunkte" height="26" src="../images/Points on.png" width="26" /></h3>
<p>Die Kontrollpunkte f&#xFC;r den Gel&#xE4;ndepfad dienen zur &#xC4;nderung von Pfadh&#xF6;he und -verlauf. Sie sind die gleichen wie die der f&#xFC;r diese Operation verwendeten Kurven. Zus&#xE4;tzlich gibt es einen Kontrollpfeil zum Verschieben der gesamten Pfadposition.</p>
<p>Diese Kontrollpunkte sind in das Gel&#xE4;nde integriert und werden bei Aktivierung der Gel&#xE4;nde-Kontrollpunkte sichtbar.</p>
<p>Sie k&#xF6;nnen im Reiter <em>Eingabedaten</em> deaktiviert werden (im <a href="Interface_Panel.html#Properties">Eigenschaftenbereich des Bearbeitungspanels</a> oder im <a href="Interface_Properties.html">Eigenschaftenexplorer-Dialog</a>), nach Auswahl des Pfads unter der <em>Erdbewegung</em>-Liste.</p>


<p><strong>Hinweis</strong>: die durch einen Pfad erzeugten Kontrollpunkte der Unterteilung sind von den Kontrollpunkten des Gel&#xE4;ndepfads abh&#xE4;ngig, egal ob sie in den Unterteilungseinstellungen aktiviert sind oder nicht.</p>