<h3>Superschraffierung</h3>
<div class="comDescr">
	<div class="field"><strong>Wo befindet sich dieser Befehl?</strong></div>
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laSuperschraffierung</div>
	
		<div class="field"><a href="Interface_Drop-down.html">Men&#xFC;</a>: </div>
	<div class="value menu">Lands Design &gt; Dokumentation &gt; Superschraffierung</div>
	
</div>
	
		


<p>Mit dem Befehl Superschraffierung wird ein texturiertes Fl&#xE4;chenelement, basierend auf einer Hintergrundbild-Wiederholung, erstellt.</p>

<ul>
	<li><a href="Commands_laSuperhatch.html#Insert">Superschraffierung einf&#xFC;gen</a></li>
	<li><a href="Commands_laSuperhatch.html#ControlPoints">Superschraffierung-Kontrollpunkte</a></li>
	<li><a href="Commands_laSuperhatch.html#Parameters">Einf&#xFC;geoptionen und -parameter</a></li>
	<li><a href="Commands_laSuperhatch.html#Display">Graphische Darstellung</a></li>
</ul>

<a name="Insert" />


<p><strong>Vorgehen:</strong></p>
<ol>
	<li>F&#xFC;hren Sie den Befehl <strong>laSuperschraffierung</strong> aus. W&#xE4;hlen Sie eine der beiden Optionen in der Befehlszeile aus, um das Superschraffierungsobjekt einzuf&#xFC;gen: <ul>
			<li><strong>Inneren Punkt</strong>: innerhalb einer geschlossenen Begrenzung von 2D-Kurven klicken.</li>
			<li><strong>Begrenzungskurve</strong>: geschlossene und planare Kurve ausw&#xE4;hlen.</li>
		</ul>
	</li>
	<li>Nach dem ersten Schritt erscheint der Einf&#xFC;gungsdialog f&#xFC;r Superschraffierung. Dieser Dialog zeigt die grundlegenden Optionen des Superschraffierung-Objekts auf einem einzigen Reiter an:
<ul>
<li><a href="Commands_laSuperhatch.html#Superhatch">Superschraffierung</a>: Superschraffierungsparameter.</li>
</ul>
W&#xE4;hlen Sie die grundlegenden Einf&#xFC;gungsoptionen. Schlie&#xDF;en Sie den Dialog durch Dr&#xFC;cken von Eingabe, Esc oder Klicken auf die rechte Maustaste.</li>
			
</ol>


<p class="figureWithDescription"><img src="../images/commands/Documentation/Superhatch.png" alt="Superschraffierung"/><br/>
Superschraffierung.
</p><br/>

<br clear="all" />
<a name="ControlPoints" />
<h3>Kontrollpunkte <img alt="Kontrollpunkte" height="26" src="../images/Points on.png" width="26" /></h3>
<p>Das Superschraffierungsobjekt hat die gleichen <em>Kontrollpunkte</em>  wie die Kurven, aus denen es erzeugt wurde, oder die w&#xE4;hrend des Einf&#xFC;gens aus den Begrenzungen des gew&#xE4;hlten Punkts erzeugte Begrenzungskurve.</p> 
<p>Zuz&#xFC;glich hat es einen Kontrollpfeil zum Verschieben der gesamten Fl&#xE4;che.</p>
<p>Um einen Superschraffierung-Kontrollpunkt zu aktivieren, f&#xFC;hren Sie den Befehl <strong>PunkteEin</strong> aus (oder dr&#xFC;cken Sie F10) und w&#xE4;hlen Sie das Superschraffierung-Objekt. Um seine Punkte zu deaktivieren, dr&#xFC;cken Sie ESC oder starten Sie den Befehl <strong>PunkteAus</strong>.</p>


<br clear="all" />

<a name="Parameters" />
<h3>Einf&#xFC;geoptionen und -parameter</h3>
<p>Die Superschraffierung-Einf&#xFC;gungsoptionen und -Parameter sind in unterschiedliche Reiter aufgeteilt und &#xFC;ber verschiedene Dialoge abrufbar:</p>
<ul>
	<li>Superschraffierung-<a href="Interface_Dialog.html">Einf&#xFC;gungsdialog</a> (nur beim Einf&#xFC;gen einer neuen Superschraffierung verf&#xFC;gbar).</li>
	<li>Abschnitt der Superschraffierung-Eigenschaften, im <a href="Interface_Panel.html">
	Lands-Design-Bearbeitungspanel</a>.</li>
	<li>Superschraffierung-<a href="Interface_Properties.html">Objekteigenschaftendialog</a>.</li>
</ul>
<h4>Allgemein</h4> 
<p>Allgemeine Attribute f&#xFC;r das Superschraffierung-Objekt: <em>Name</em>, <em>Farbe</em>, <em>Ebene</em>, <em>Code</em> und <em>Stichw&#xF6;rter</em>.</p>

<a name="Superhatch" />
<h4>Superschraffierung</h4>
<p>Klicken Sie auf die Schaltfl&#xE4;che <em>Durchsuchen</em> zum Ausw&#xE4;hlen (oder &#xC4;ndern) eines Bilds aus der Lands-Texturenbibliothek oder auf Ihrem PC. Bearbeiten Sie die Werte, um es zu skalieren oder drehen.</p>

<a name="Display" />
<h3>Grafische Darstellung der Superschraffierung:</h3>
<p>Das Superschraffierung-Objekt wird als texturierte Fl&#xE4;che dargestellt, die in jeglichem Anzeigemodus sichtbar ist.</p>

