<h3>Bildfilter anwenden</h3>
<div class="comDescr">
	<div class="field"><strong>Wo befindet sich dieser Befehl?</strong></div>
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laBildfilter</div>
	
	<div class="field">Symbol: </div>
	<div class="value icon"><img src="../images/Icon/laImageFilters.png" alt="Bildfilter"/> Linksklick

	</div>
	
	<div class="field">Werkzeugleiste:<a href="Interface_Toolbars.html#ToolsToolbar">Lands-Werkzeuge</a></div>
	<div class="value toolbar"><img src="../images/Toolbar/Tools Toolbar.png" alt="Werkzeugleiste Lands-Werkzeuge" usemap ="#ToolsToolbarMap"/></div>
	
	<div class="field"><a href="Interface_Drop-down.html">Men&#xFC;</a>: </div>
	<div class="value menu">Lands Design &gt; Bildfilter</div>
	
</div>

<p>Die Bildfilteranwendung ist ein installierter Editor, mit dem Sie mehrere Filter auf die gerenderten Bilder, Ansichtserfassungen oder jede sonstige Bilddatei anwenden k&#xF6;nnen.</p>
<p>Durch Ausf&#xFC;hren des Befehls <strong>laBildfilter</strong> wird der Bildfilter-Dialog ge&#xF6;ffnet. Dieser Dialog ist in drei Bereiche aufgeteilt:</p>
<ol>
<li><a href="Commands_laImageFilters.html#Toolbar">Werkzeugleiste</a></li>
<li><a href="Commands_laImageFilters.html#Preview">Bildvorschau</a></li>
<li><a href="Commands_laImageFilters.html#Edit">Bearbeitungsbereich</a></li>
</ol>

<p class="figureWithDescription"><img src="../images/commands/Image Filters/Image Filter Dialog 600.png" alt="Bildfilter-Dialog."/><br/>
Bildfilter-Dialog.
</p>
<br clear="all" />
<a name="Toolbar" />
<h3>1. Werkzeugleiste</h3>
<h4>Dateibefehle</h4>
<ul>
<li><strong>&#xD6;ffnen</strong></li>
<li><strong>Speichern</strong></li>
<li><strong>Kopieren</strong></li>
<li><strong>Einf&#xFC;gen</strong></li>
</ul>
<a name="Toolbar" />
<h4>Bildvorschau-Befehle</h4>
<ul>
<li><strong>1:1</strong>: zoomt die Bildvorschau, damit das Bild im Gr&#xF6;&#xDF;enverh&#xE4;ltnis 1 zu 1 angezeigt wird.</li>
<li><strong>Voll</strong>: zoomt das Ansichtsfenster, damit das Bild in vollst&#xE4;ndiger Gr&#xF6;&#xDF;e angezeigt wird. </li>
<li><strong>Original</strong>: zeigt das Bild so, wie es vor Anwendung jeglichen Effekts aussah.</li>
</ul>

<h4>Effekte</h4>
<p>Mit den Effekt-Schaltfl&#xE4;chen wird der Bildaspekt nach unterschiedlichen Parametern ge&#xE4;ndert. Klicken Sie auf den gew&#xFC;nschten Effekt, um ihn im Bearbeitungsbereich hinzuzuf&#xFC;gen. F&#xFC;gen Sie weitere Effekte durch Klicken auf die Schaltfl&#xE4;che <em>Hinzuf&#xFC;gen</em> hinzu, sowie durch Auswahl des hinzuzuf&#xFC;genden Effekts.</p>
<ul>
<li><strong>Versch&#xE4;rfen</strong></li>
<li><strong>Leuchten</strong></li>
<li><strong>Hochformat</strong></li>
<li><strong>Freihandwerkzeug</strong></li>
<li><strong>Tinte</strong></li>
<li><strong>&#xD6;l</strong></li>
<li><strong>Median</strong></li>
<li><strong>Rauschen</strong></li>
</ul>

<h4>Bearbeitungsbereich-Befehle</h4>
<ul>
<li><strong>Hinzuf&#xFC;gen</strong>: f&#xFC;gt einen Effekt im Bearbeitungsbereich hinzu.</li>
<li><strong>Entfernen</strong>: entfernt einen Effekt aus dem Bearbeitungsbereich.</li>
<li><strong>Nach oben bewegen</strong>: verschiebt einen Effekt in der Liste des Bearbeitungsbereichs nach oben.</li>
<li><strong>Nach unten bewegen</strong> verschiebt einen Effekt in der Liste des Bearbeitungsbereichs nach unten.</li>
</ul>
<a name="Preview" />
<h3>2. Vorschaubereich</h3>
<p>Zeigt eine Vorschau des in der Bearbeitung befindlichen Bilds.</p>
<a name="Edit" />
<h3>3. Bearbeitungsbereich</h3>
<p>Bei seiner Auswahl wird ein Effekt dem Bearbeitungsbereich hinzugef&#xFC;gt. Ein Kontrollk&#xE4;stchen erscheint neben dem Namen des Effekts. Ist es aktiviert, k&#xF6;nnen Sie die Parameter des ausgew&#xE4;hlten Effekts &#xE4;ndern, der auf das Bild angewandt wird.</p>
<p>Die Effekte werden in der Reihenfolge in der Liste auf das Bild angewandt. Diese Reihenfolge kann mittels der Schaltfl&#xE4;chen <em>Nach oben bewegen</em> und <em>Nach unten bewegen</em> in der Werkzeugleiste ver&#xE4;ndert werden.</p>