<h3>Pflanzen zeichnen</h3>
<div class="comDescr">
	<div class="field"><strong>Wo befindet sich dieser Befehl?</strong></div>
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laPflanzenZeichnen</div>
	
	<div class="field">Symbol: </div>
	<div class="value icon"><img src="../images/Icon/laPlantsPaint.png" alt="Pflanzen zeichnen"/> Linksklick

	</div>
	
	<div class="field">Werkzeugleiste: <a href="Interface_Toolbars.html#ObjectsToolbar">Lands-Objekte</a>: </div>
	<div class="value toolbar"><img src="../images/Toolbar/Plant Toolbar.png" alt="Pflanzen-Befehle" usemap ="#PlantToolbarMap" /></div>
	
	<div class="field"><a href="Interface_Drop-down.html">Men&#xFC;</a>: </div>
	<div class="value menu">Lands Design &gt; Vegetation &gt; Pflanzen zeichnen</div>
</div>


<p>Der Befehl Pflanzen zeichnen erm&#xF6;glicht Ihnen das Einf&#xFC;gen mehrerer in dreieckiger (gleichseitiger) Anordnung verteilter Pflanzen entlang des Pfads, wo Sie den Mauszeiger hinbewegen.</p>


<h3>Eine Pflanze beim Zeichnen einf&#xFC;gen</h3>
<p>Durch Ausf&#xFC;hren des Befehls <strong>laPflanzenZeichnen</strong> wird der <a href="Interface_Dialog.html">Einf&#xFC;gedialog</a> f&#xFC;r Pflanze ge&#xF6;ffnet. Dieser Dialog zeigt die grundlegenden Optionen des Pflanzenobjekts auf drei verschiedenen Reitern an.</p>
<ul>
<li><a href="Commands_laPlant.html#Plant">Pflanze</a>: Art, Kaliber, Darstellungsmodus und Bema&#xDF;ungen in der Zeichnung.</li>
<li><a href="Commands_laPlant.html#Format">Format</a>: Format der Pflanzenart.</li>
<li><a href="Commands_laPlant.html#Render">Rendern</a>: Parameter zur Definierung, wie das Pflanzenobjekt in einer Renderdarstellung aussieht.</li>
</ul>

<p><strong>Vorgehen:</strong></p>
<ol>
	<li>W&#xE4;hlen Sie eine <strong>Pflanzenart</strong> aus der Liste, unter dem Reiter Pflanze. Klicken Sie auf die Schaltfl&#xE4;che 
	<strong>Durchsuchen...</strong> um eine neue aus der <a href="Commands_laPlantDatabase.html">Pflanzendatenbank</a> auszuw&#xE4;hlen.</li>
	<li>W&#xE4;hlen Sie die restlichen <strong>Einf&#xFC;gungsparameter</strong> aus (Kaliber, Darstellungsmodus, und Bema&#xDF;ungen in der Zeichnung) und klicken Sie auf OK, um den Dialog zu schlie&#xDF;en.</li>
	<li>Klicken Sie mit der linken Maustaste im Modell, um die erste Pflanze einzuf&#xFC;gen. Die n&#xE4;chsten Pflanzen werden entlang des Pfads eingef&#xFC;gt wo Sie den Mauszeiger hinbewegen, wobei eine dreieckige (gleichseitige) Anordnung je nach Gr&#xF6;&#xDF;e der Pflanze erstellt wird.</li>
	<li>Klicken Sie erneut mit der linken Maustaste, um das Einf&#xFC;gen von Pflanzen zu beenden, und w&#xE4;hlen Sie einen anderen Standort um mit dem Einf&#xFC;gen der Pflanzen w&#xE4;hrend des Zeichnens zu beginnen.</li>
	<li>Beenden Sie den Befehl durch Dr&#xFC;cken von EINGABE, ESC oder Klicken auf die rechte Maustaste.</li>
</ol>

<p><strong>L&#xF6;schen Sie Pflanzen beim Zeichnen</strong></p>

<ol>
	<li>Bei Ausf&#xFC;hrung des Befehls laPflanzenZeichnen w&#xE4;hlen Sie die Option <strong>L&#xF6;schen</strong> in der <em>Befehlszeile</em>.</li>
	<li>Klicken Sie mit der linken Maustaste, um mit dem L&#xF6;schen von Pflanzen zu beginnen. Die entlang des Pfads platzierten Pflanzen werden beim dar&#xFC;berfahren mit dem Mauszeiger gel&#xF6;scht.</li>
	<li>Klicken Sie erneut mit der linken Maustaste, um das L&#xF6;schen von Pflanzen zu beenden, und w&#xE4;hlen Sie einen anderen Standort um mit dem L&#xF6;schen der Pflanzen w&#xE4;hrend des Zeichnens fortzufahren.</li>
	<li>Beenden Sie den Befehl durch Dr&#xFC;cken von EINGABE, ESC oder Klicken auf die rechte Maustaste.</li>
</ol>

<p><strong>Hinweis</strong>: W&#xE4;hlen Sie die Optionen <em>L&#xF6;schen</em> oder <em>Zeichnen</em> in der Befehlszeile, um je nachdem in den Modus Zeichnen oder L&#xF6;schen zu wechseln, w&#xE4;hrend Sie den Befehl laPflanzenZeichnen ausf&#xFC;hren.</p>
<p class="figureWithDescription"><img src="../images/commands/Plant/Plant Paint 2D.png" alt="Befehl Pflanzen zeichnen."/><br/>
Pflanzen in 2D w&#xE4;hrend der Ausf&#xFC;hrung des Befehls Pflanzen zeichnen.
</p><br/>
<br clear="all" />
<h3><strong>Nat&#xFC;rliche Variation</strong></h3>

<p>Wenn sie aktiviert ist, setzt diese Option eine willk&#xFC;rliche H&#xF6;henvariation f&#xFC;r die eingef&#xFC;gten Pflanzenarten. Der Maximalwert (100 %) erzeugt Pflanzenarten, die von 50 % bis zu 150 % ihrer Gr&#xF6;&#xDF;e reichen.</p>
