<h3>Objekteigenschaftendialog</h3>

<div class="comDescr">
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laEigenschaften</div>
	
	
	<div class="field">Tastenkombination: </div>
	<div class="value menu">Doppelklicken Sie auf das zu bearbeitende Objekt</div>
</div>

<p>Der <strong>Objekteigenschaften-Dialog</strong> ist ein schwebendes Dialogfenster, mit dem Sie die in Lands Design ausgew&#xE4;hlten Objekteigenschaften bearbeiten k&#xF6;nnen.</p>
<p>Um den Eigenschaftendialog zu &#xF6;ffnen, f&#xFC;hren Sie den Befehl <strong>laEigenschaften</strong> aus und w&#xE4;hlen Sie das zu bearbeitende Objekt bzw. die Objekte. Dr&#xFC;cken Sie Eingabe oder klicken Sie mit der rechten Maustaste, um die Auswahl zu beenden.</p>

<p class="figureWithDescription"><img src="../images/Properties Dialog.png" alt="Lands Design Objekteigenschaftendialog."/><br/>
Lands Design Objekteigenschaftendialog.</p>


<p>Der <strong>Objekteigenschaftendialog</strong> ist in verschiedene Reitern aufgeteilt, je nach Objekttyp.</p>
<p>Wenn beim Ausf&#xFC;hren des Befehls <strong>laEigenschaften</strong> mehr als ein Objekttyp ausgew&#xE4;hlt ist, zeigt das <strong>Dialogfeld Objekteigenschaften</strong> nur die allgemeinen Reiter an.</p>

<h3>Reiter</h3>
<ul>

<li><strong>Allgemein:</strong><br />
Alle Lands-Design-Elemente verf&#xFC;gen &#xFC;ber diesen Reiter. Er bestimmt die allgemeinen Attribute des ausgew&#xE4;hlten Objekts, wie z.B. Name, Farbe, Ebene, Code und Stichw&#xF6;rter.</li>



<li><strong>Rendern:</strong><br />
Dieser Reiter ist f&#xFC;r Pflanzen, Pflanzenreihen, W&#xE4;lder und B&#xFC;sche. Er bestimmt das Aussehen der Pflanzenarten in einer Renderdatei hinsichtlich der Jahreszeit und ihrer Laubdichte.</li>


<li><strong>Pflanze:</strong><br />
Dieser Reiter ist f&#xFC;r Pflanzen, Pflanzenreihen, W&#xE4;lder und B&#xFC;sche. Er legt die Eigenschaften der Pflanzenarten fest.</li>


<li><strong>Reihe:</strong><br />
Dieser Reiter ist f&#xFC;r Pflanzenreihen und Reihen. Er bestimmt die Pflanzenreihen- und Reihenparameter.</li>

<li><strong>Bodendecker:</strong><br />
Nur Bodendecker verf&#xFC;gen &#xFC;ber diesen Reiter. Er legt die Parameter des Bodendeckers fest.</li>

<li><strong>Teilerwand/Hecke:</strong><br />
Nur Teilerwand-/Heckenobjekte verf&#xFC;gen &#xFC;ber diesen  Reiter. Er legt die Parameter der Teilerwand/Hecke fest.</li>

<li><strong>Zaun:</strong><br />
Nur Zaunobjekte verf&#xFC;gen &#xFC;ber diesen Reiter. Er legt die Zaunparameter fest.</li>

<li><strong>Treppe:</strong><br />
Nur Treppenobjekte verf&#xFC;gen &#xFC;ber diesen Reiter. Er legt die Treppenparameter fest.</li>

<li><strong>Pfad:</strong><br />
Nur Pfade verf&#xFC;gen &#xFC;ber diesen Reiter. Er legt die Pfadparameter fest. </li>

<li><strong>Gel&#xE4;nde:</strong><br />
Nur Gel&#xE4;nde verf&#xFC;gen &#xFC;ber diesen Reiter. Er legt die Gel&#xE4;ndeparameter fest. </li>
</ul>
















