<h3>Kompatibilit&#xE4;t von Lands Design und Rhino (Befehle und Benutzeroberfl&#xE4;che)</h3>

<h3>Rhino-Befehle</h3>

<p>Da es sich bei Lands-Design-Objekten eigentlich um Rhino-Bl&#xF6;cke handelt, sind alle Rhino-Befehle, die Bl&#xF6;cke betreffen, auch ohne Probleme auf Lands-Design-Objekte anwendbar. Andere Befehle wurden angepasst; beispielsweise die Befehle zum Duplizieren von Objekten (wie Kopieren, Anordnen und Spiegeln) oder bestimmte Windows-Bearbeitungsbefehle (wie Ausschneiden, Kopieren und Einf&#xFC;gen: Strg+X, Strg+C bzw. Strg+V).<br />
Beim Ausf&#xFC;hren von Rhino-Befehlen, die nicht von Lands Design unterst&#xFC;tzt werden, k&#xF6;nnen keine Lands-Design-Objekte ausgew&#xE4;hlt werden.</p>

<p>Der Befehl <strong>Zerlegen</strong> entfernt die Eigenschaften von Lands-Design-Objekten und wandelt diese in Blockinstanzen, Polygonnetze und Fl&#xE4;chenverb&#xE4;nde um. In diesem Fall k&#xF6;nnen Sie sie wie beliebige Rhino-Fl&#xE4;chenverb&#xE4;nde bearbeiten. <br/>
Im Gegensatz zu anderen Lands-Design-Objekten k&#xF6;nnen die Vegetationsobjekte (Pflanzen, Bodendecker und B&#xFC;sche) in der WIP-Version von Lands Design nicht zerlegt werden.</p>

<h3>Rhino-Befehlsverhalten</h3>

<ul>
	<li><strong>Letzten Befehl und zuletzt verwendete Befehle wiederholen:</strong><br />
		Wie bei den Rhino-Befehlen k&#xF6;nnen die meisten Lands-Design-Befehle wie folgt wiederholt werden: 
		<ul>
			<li>Um den zuletzt verwendeten Befehl zu wiederholen, dr&#xFC;cken Sie die EINGABETASTE, die LEERTASTE oder klicken Sie mit der rechten Maustaste, solange gerade kein anderer Befehl ausgef&#xFC;hrt wird. </li>
			<li>Um einen k&#xFC;rzlich verwendeten Befehl zu wiederholen, klicken Sie mit der rechten Maustaste in die Befehlszeile.
			</li>
	</ul>
	</li>
	<li><strong>Objekte ausw&#xE4;hlen:</strong><br />
		Wie bei den Rhino-Befehlen erfordern die meisten Operationen in Lands Design die Auswahl eines oder mehrerer Objekte. Lands-Design-Objekte werden wie Rhino-Objekte ausgew&#xE4;hlt:
		<ul>
			<li>Um ein einzelnes Objekt auszuw&#xE4;hlen, klicken Sie auf das Objekt.</li>
			<li>Um mehrere Objekte auszuw&#xE4;hlen, dr&#xFC;cken Sie die Umschalttaste, w&#xE4;hrend Sie auf das gew&#xFC;nschte Objekt klicken, oder verwenden Sie die Fensterauswahl.</li>
		</ul>
	</li>
	<li><strong>Modellierhilfen und Objektf&#xE4;nge:</strong><br />
		F&#xFC;r Lands-Design-Objekte k&#xF6;nnen Modellierhilfen (Rasterfang, Orthogonal- und Planar-Modus) und Objektf&#xE4;nge (End, N&#xE4;chst, Punkt, Mitte, Zentrum, Schnitt, Lot, Scheitelpunkt usw.) auf die gleiche Art und Weise wie f&#xFC;r Rhino-Objekte verwendet werden.) Da es sich bei den meisten der Lands-Design-Objekte tats&#xE4;chlich um Polygonnetze handelt, m&#xFC;ssen Sie m&#xF6;glicherweise den Objektfang Scheitelpunkt verwenden.</li>
</ul>
<h3>Kontrollpunkte</h3>
<div class="comDescr">
	<div class="field">Tastatur: </div>
	<div class="value keyboardCommand">PunkteEin/PunkteAus</div>
	
	<div class="field">Symbol: </div>
	<div class="value icon"><img src="../images/Points on.png" alt="Punkte aus"/> Kontrollpunkte aus: Rechtsklick</div>
	
		
	<div class="field">Men&#xFC;: </div>
	<div class="value menu">Bearbeiten &gt; Kontrollpunkte &gt; Kontrollpunkte ein/aus</div>
	
	<div class="field">Tastenkombination: </div>
	<div class="value menu">Kontrollpunkte&#xA0;ein (F10), Kontrollpunkte aus (F11)</div>

	
	
</div>

<p>Alle Lands-Design-Objekte k&#xF6;nnen durch Aktivieren ihrer Kontrollpunkte bearbeitet werden. Hierf&#xFC;r k&#xF6;nnen dieselben Befehle wie in Rhino verwendet werden.</p>
<p class="figureWithDescription">
<img src="../images/commands/Plant Row/Plant row control points 450.jpg" alt="Pflanzenreihe mit aktivierten Kontrollpunkten" /><br/>
Pflanzenreihe mit aktivierten Kontrollpunkten.</p>
