<h3>Lands-Design-Optionen</h3>

<p>Lands Design erm&#xF6;glicht Ihnen die Personalisierung seiner Funktionsweise durch die Ab&#xE4;nderung einiger Optionen oder Einstellungen.</p>
<p>Diese Einstellungen sind f&#xFC;r jedes Lands-Dokument wirksam, wenn das Programm ausgef&#xFC;hrt wird.</p>

<p>Um den Dialog der <strong>Lands-Design-Optionen</strong> zu &#xF6;ffnen, gehen Sie ins 
<a href="Interface_Drop-down.html">Lands Design Dropdown-Men&#xFC;</a> &gt; Optionen...</p>

<p>Das Optionen-Dialogfenster von Lands Design erscheint mit verschiedenen Reitern. Auf jedem Reiter wird ein Abschnitt mit den verf&#xFC;gbaren Einstellungen angezeigt:</p>
<ul>
<li><a href="Interface_LandsDesignOptions.html#General">Allgemein</a></li>
<li><a href="Interface_LandsDesignOptions.html#Layers">Ebenen</a></li>

<li><a href="Interface_LandsDesignOptions.html#Data">Datenquellen</a></li>

</ul>
<p class="figureWithDescription"><img src="../images/Lands Design Options.png" alt="Optionen-Dialogfenster von Lands Design, Reiter Allgemein"/><br />
	Optionen-Dialogfenster von Lands Design, Reiter Allgemein</p>


	
<a name="General" />
<h3>Allgemein</h3>
<p>Der Reiter Allgemein ist in drei Abschnitte aufgeteilt:</p>
<ul>
<li><strong>Sprache</strong>: Sie k&#xF6;nnen die Sprache der Lands-Design-Benutzeroberfl&#xE4;che aus den von Rhino auf dem Computer installierten Sprachen ausw&#xE4;hlen. Lands Design ist in 6 Sprachen erh&#xE4;ltlich: Deutsch, Englisch, Franz&#xF6;sisch, Italienisch, Spanisch und Chinesisch (vereinfacht). Starten Sie Lands nach &#xC4;nderung der Sprache neu.</li>
<li><strong>Bearbeiten</strong>: Einige &#xC4;nderungen, welche sich auf die Bearbeitung von Objekten auswirken, k&#xF6;nnen angewandt werden:
	<ul>
		<li>Automatische Aktualisierung: Aktiviert oder deaktiviert die automatische Aktualisierung von Lands-Design-Objekten in der Zeichnung.</li>
		<li>Das Bearbeitungspanel beim Start anzeigen: Sie k&#xF6;nnen ausw&#xE4;hlen, ob Sie das <a href="Interface_Panel.html">Bearbeitungspanel</a> bei jedem Start von Lands Design &#xF6;ffnen.</li>
		<li>Maximalwerte zur Bearbeitung von Objekten: Zum Definieren der maximalen Einheiten in Reihen, W&#xE4;ldern und Anordnungen. Zum Definieren der H&#xF6;chstanzahl von Rasterpunkten auf Gel&#xE4;nden.</li>
	</ul>
</li>


<li><strong>Meldungen und Nachrichten</strong>: W&#xE4;hlen Sie ob Sie den "Willkommensdialog", den "Splash-Screen" oder die Frage "Welches Einheitensystem verwenden" beim Starten von Lands Design sehen m&#xF6;chten oder nicht.</li>
</ul>
<a name="Layers" />

<h3>Ebenen</h3>

<p>Dieser Reiter bestimmt Name und Farbe der Ebenen, die Lands Design f&#xFC;r jeden Objekttyp erzeugt, wenn diese in das Modell eingef&#xFC;gt werden.</p>

<p>Wenn die Markierung des jeweiligen Objekttyps aufgehoben ist, wird das Lands-Element auf der gem&#xE4;&#xDF; der Dokumenteigenschaften zugewiesenen Ebene erzeugt (Rhino-Optionen &gt; Lands Design &gt; Ebenen). Wenn die Ebene auf Keine eingestellt ist, wird das Objekt auf der aktuellen Ebene erzeugt. </p>


<p>Die Verbindungen des Typs Objekt-Ebene, die in der aktuellen Zeichnung definiert sind, k&#xF6;nnen auch im Ebenen-Reiter aktiviert werden, und zwar in den Dokumenteigenschaften unten im <a href="Interface_Panel.html">Bearbeitungspanel</a>.</p>

<p class="figureWithDescription"><img src="../images/Layer Options.png" alt="Optionen-Dialogfenster von Lands Design, Reiter Ebenen"/><br />
	Optionen-Dialogfenster von Lands Design, Reiter Ebenen</p>

<a name="Data" />
<h3>Datenquellen</h3>
<h4>Stadtm&#xF6;belbl&#xF6;cke</h4>
<p>Dieser Reiter ist beim Verwalten der Verzeichnisse hilfreich, wo Lands- und andere Bl&#xF6;cke gespeichert werden.</p>

<p> Klicken Sie auf die Schaltfl&#xE4;che <strong>Neu...</strong> um das Dialogfenster der Datenquellen zu &#xF6;ffnen und ein neues Verzeichnis zu erstellen. W&#xE4;hlen Sie Namen und Standort des Verzeichnisses.</p>
<p>Klicken Sie auf die Schaltfl&#xE4;che <strong>&#xC4;ndern...</strong>, um den Namen bzw. Ort des Verzeichnisses zu &#xE4;ndern, und auf <strong>L&#xF6;schen</strong>, um es aus der Liste zu entfernen.</p>

<h4>Zentralisierter Inhaltsordner</h4>
<p>Diese Option erm&#xF6;glicht Ihnen die Auswahl eines geteilten Ordners in einem Netzwerkpfad zum Teilen von Inhalten (Pflanzentexturen, Fotos, &#xC4;nderungen in der Datenbank) mit anderen Mitgliedern Ihres Teams. Wenn dieser Pfad leer ist, wird Lands die Inhalte &#xF6;rtlich f&#xFC;r den aktuell verwendeten PC erstellen.
</p>

<p class="figureWithDescription"><img src="../images/Data Sources Options.png" alt="Optionen-Dialogfenster von Lands Design, Reiter Datenquellen"/><br />
	Optionen-Dialogfenster von Lands Design, Reiter Datenquellen</p>
<br clear="all" />
<p class="figureWithDescription"><img src="../images/Data Source.png" alt="Dialogfenster Datenquellen"/><br />
	Dialogfenster Datenquellen</p>
<br clear="all" />

<a name="Render" />
<h3>Rendern</h3>
<p>Dieser Reiter erm&#xF6;glicht Ihnen das Spezifizieren eines tempor&#xE4;ren Ordners zum Abspeichern von Texturdateien in einer Reihenfolge, die verschiedenen Ger&#xE4;ten im gleichen Netzwerk Zugriff darauf gestattet.</p>

<h3><a name="RhinoOptions"></a>Lands-Design-Optionen (im Dialogfenster der Rhino-Optionen)</h3>
<p>Lands-Design-Optionen sind auch im Dialogfenster der <strong>Rhino-Optionen</strong> verf&#xFC;gbar (Dropdown-Men&#xFC; &gt; Werkzeuge &gt; Optionen...)</p>
	
	<p class="figureWithDescription"><img src="../images/Rhino Options.png" alt="Allgemeine Optionen von Lands Design im Rhino-Optionendialog"/><br />
	Allgemeine Optionen von Lands Design im Dialogfenster der Rhino-Optionen</p>


