<h3>Rendern</h3>

<p>Die Lands-Design-Objekte unterst&#xFC;tzen Materialien aus allen <strong>Renderern</strong>, die mit Rhino kompatibel sind. Die Materialzuordnung an Objekte funktioniert wie in Rhino.</p>

<p>Lands Design schlie&#xDF;t die nXt-Grundtechnologie des Flamingo nXt Render-plug-ins mit ein. Damit kann Lands Design sehr realistische Pflanzen zum Rendern und texturierte Low-Poly-Pflanzen f&#xFC;r die Echtzeit-Darstellung erzeugen, und zwar mit jedem f&#xFC;r Rhino erh&#xE4;ltlichen Renderer, wie V-Ray, Brazil, Maxwell, etc. </p>

<p>Eine umfassende Bibliothek f&#xFC;r Flamingo-nXt-Pflanzen, verbunden mit den Lands-Datenbank-Arten, wird standardm&#xE4;&#xDF;ig installiert. Diese Dateien enthalten alle Texturen und Materialien f&#xFC;r jede Pflanzenart.</p>
<p>Um die Vorteile des nxt-Pflanzengenerators und der mit Pflanzenarten verbundenen nxt-Dateien auszusch&#xF6;pfen, ist Flamingo nXt zwar empfehlenswert, aber nicht unbedingt notwendig.</p>


<h3>Realistische Pflanzen und Bodendecker</h3>

<p>Flamingo nXt hebt sich aufgrund der F&#xE4;higkeit, sehr realistische dreidimensionale Pflanzen zu rendern, von anderen Rendering-Plug-ins ab; dies anhand einer Reihe von Werten f&#xFC;r die Parameter, die die Erscheinung der Pflanze bestimmen, zum Beispiel Pflanzenh&#xF6;he, Dichte der Zweige, Stammdicke, etc. Diese Werte werden als Pflanzendefinitionsdateien gespeichert.</p>

<p>Lands Design erm&#xF6;glicht dem Anwender die Verwendung realistischer nXt-Pflanzen durch Zuweisung einer Pflanzendefinitionsdatei an die Pflanzenarten und Bodendecker.</p>

<p>Die Eigenschaften der Lands-Design-Pflanzen und Bodendecker erh&#xF6;hen sich bei Zuweisung einer nXt-Datei. Diese neuen Eigenschaften haben keinen Einfluss auf die Erscheinung der Pflanzen in der Zeichnung und werden nur verwendet, wenn mit nXt gerendert wird.</p>
<p>Folgende Rendereigenschaften sind im Bearbeitungspanel verf&#xFC;gbar:</p>

<ul>
	<li><strong>Jahreszeit</strong>: wenn das K&#xE4;stchen <em>Globale Jahreszeit ignorieren</em> markiert ist, k&#xF6;nnen Sie ausw&#xE4;hlen, in welcher Jahreszeit die Pflanzen gerendert werden, wobei Sie aus 7 vorhandenen Werten ausw&#xE4;hlen k&#xF6;nnen: Vorfr&#xFC;hling, Fr&#xFC;hling, Sp&#xE4;tfr&#xFC;hling, Sommer, Sp&#xE4;tsommer, Herbst und Winter.</li>
	<li><strong>Laubdichte</strong>: Je nach Definition erzeugt Flamingo nXt mehr oder weniger Bl&#xE4;tter.</li>
</ul>


<p>Mit Rhino kompatible Software f&#xFC;r <strong><a href="http://www.rhino3d.com/resources/?id=315">Animation und Rendering</a></strong>:</p>
<table>
<tr>
<td valign="top" align="left" height="20">
<ul>

<li>
<b><a href="http://www.rhino3d.com/resources/?id=4300">
 <u> Air Rendering Software</u></a>:</b> Photoreal + illustration rendering + IpR (<i>Plug-in</i>)</li>

<li>
<b><a href="http://www.rhino3d.com/resources/?id=640"><u>Bongo</u></a>:</b> Animation f&#xFC;r Designer(<i>Plug-in</i>)
</li>


<li>
<b><a href="http://www.rhino3d.com/resources/?id=4535"> <u>Brazil f&#xFC;r Rhino</u></a>:</b> Fortgeschrittene Rendering-Werkzeuge f&#xFC;r Profis (<i>Plug-in</i>)
</li>

<li>
<b><a href="http://www.rhino3d.com/resources/display.asp?listing=22">
<u>Flamingo nXt</u>:</a></b> Raytrace und Radiosity Rendering (<i>Plug-in</i>)
</li>

<li>
<b><a href="http://www.rhino3d.com/resources/?id=4682"><u>Hayabusa 2.0 f&#xFC;r Rhino</u></a>:</b> Echtzeit-HQ-Renderer f&#xFC;r Rhinoceros (<I>mit 3DM-Unterst&#xFC;tzung</I>)
</li>

<li>
<b><a href="http://www.rhino3d.com/resources/?id=4719"><u>KeyShot</u></a>:</b> Programm zum Echtzeit-Raytracing und f&#xFC;r Globale Beleuchtung (<I>mit 3DM-Unterst&#xFC;tzung</I>)
</li>

<li>
<b><a href="http://www.rhino3d.com/resources/?id=682"><u>Maxwell Render, der Lichtsimulator</u></a>:</b> Maxwell Render Plug-in f&#xFC;r Rhino (<I>Plug-in</I>)
</li>

<li>
<b>
<a href="http://www.rhino3d.com/resources/?id=4809"><u>NuGraf f&#xFC;r gro&#xDF;es CAD-Rendering</u>:</a></b> Multithread-Raytracing und 3D-Konversion f&#xFC;r Rhino (<i>Plug-in</i>)
</li>

<li>
<b><a href="http://www.rhino3d.com/resources/display.asp?listing=4423"><u>
Penguin</u>:</a></b> Konzeptueller, nicht-photorealistischer Renderer (<i>Plug-in</i>)
</li>

<li>
<b><a href="http://www.rhino3d.com/resources/?id=273"><u>
Renderosity</u>:</a></b> Rhino-Diskussionsforum (<I>Link</I>)
</li>

<li>
<b><a href="http://www.rhino3d.com/resources/?id=9"><u>RhinoMan:</u>
</a></b> RenderMan-kompatibles Rendering-Plug-in (<i>Plug-in</i>)
</li>


<li><b><a href="http://www.rhino3d.com/resources/?id=870"><u>V-Ray for Rhino:</u></a></b> Erweiterter Globale-Beleuchtungs-Renderer (<i>Plug-in</i>)
</li>
<li><b><a href="http://www.rhino3d.com/resources/?id=4690"><u>VSR Echtzeit-Renderer:</u></a></b> Voll integrierter Echtzeit-Renderer, verf&#xFC;gbar als Rhino-Anzeigemodus (<i>Plug-in</i>)
</li>



</ul>
</td>
</tr>
</table>


