<h3>Animationsfenster</h3>

<div class="comDescr">
	<div class="field"><strong>Wo befindet sich dieser Befehl?</strong></div>
	<div class="field"><a href="Interface_Commands.html">Tastatur</a>: </div>
	<div class="value keyboardCommand">laAnimationsFenster</div>
	
	<div class="field">Symbol: </div>
	<div class="value icon"><img src="../images/Icon/laAnimationPanel.png" alt="Animationsfenster"/> Linksklick

	</div>
	
	<div class="field">Werkzeugleiste: <a href="Interface_Toolbars.html#ToolsToolbar">Lands-Werkzeuge</a></div>
	<div class="value toolbar"><img src="../images/Toolbar/Tools Toolbar.png" alt="Werkzeuge" usemap ="#ToolsToolbarMap" /></div>
	
	<div class="field"><a href="Interface_Drop-down.html">Men&#xFC;</a>: </div>
	<div class="value menu">Lands Design &gt; Animationsfenster</div>
</div>


<p>Die Animation ist ebenfalls hilfreich, um Studien der Sonnenbewegung in der Landschaft zu erhalten, einschlie&#xDF;lich der Simulation von Vegetations&#xE4;nderungen &#xFC;ber Jahre oder Jahreszeiten hinweg.
</p>


<p>Das <strong>Lands-Animationsfenster</strong> ist ein andockbares Panel, womit Sie im gesamten Prozess Animationen erzeugen, abspielen und rendern k&#xF6;nnen.</p>
<p>Im Lands-Animationsfenster k&#xF6;nnen Sie:</p>
<ul>
	<li>Studien zur Sonnenbewegung &#xFC;ber einer Landschaft durchf&#xFC;hren.</li>
	<li>Die Simulation der Vegetations&#xE4;nderungen &#xFC;ber Jahre und Jahreszeiten hinweg studieren.</li>
	<li>Animationen im gesamten Projekt ausf&#xFC;hren.</li>
	<li>Videos unter Verwendung fotorealistischer Renderings oder Screenshots aufnehmen.</li>
</ul>

<p>Das Lands-Animationsfenster ist in drei Bereiche unterteilt:</p>
<ol>
	<li><a href="Interface_AnimationPanel.html#Playback">Steuerungen zur Wiedergabe</a></li>
	<li><a href="Interface_AnimationPanel.html#Animation">Animationsparameter</a></li>
	<li><a href="Interface_AnimationPanel.html#Render">Rendereinstellungen</a></li>
	
</ol>


<p class="figureWithDescription"><img src="../images/AnimationPanel.png" alt="Lands-Design-Animationsfenster."/><br/>
Lands-Animationsfenster.</p>

<a name="Playback" />
<h3>1. Steuerungen zur Wiedergabe</h3>

<p>Die Steuerungen zur Wiedergabe erm&#xF6;glichen Ihnen die Vorschau Ihrer Animation vor dem Rendern. Die vorhandenen Funktionen sind allen Media-Playern gemein: Play zum Starten / Fortsetzen der Animation, Stop zum Stoppen und R&#xFC;ckkehren zum Anfang und Pause zum Anhalten des Bilds.</p>
<p>Zur Aktivierung der Wiedergabe-Steuerung ist es erforderlich, einen Kamerapfad festzulegen. Der Player wird den Anzeigemodus des Ansichtsfensters beibehalten.</p>
<p></p>

<a name="Animation" />
<h3>2. Animationsparameter</h3>
<p>In diesem Bereich sind die in drei verschiedene Reiter gruppierten Animationsparameter zu sehen, wie auch die allgemeinen Animationseinstellungen.</p>

<h4>Allgemein</h4>

<ul>
<li><strong>Speichern</strong>: zum Speichern der aktuellen Parameter geben Sie einen Namen ein oder w&#xE4;hlen Sie einen bereits vorhandenen zur Wiederherstellung aus.</li>
<li><strong>Frame/s</strong>: bestimmt die Anzahl in der Animation enthaltener Bilder pro Sekunde. Je gr&#xF6;&#xDF;er die Anzahl von Bildern, desto flie&#xDF;ender die Bewegung (jedoch bei umso gr&#xF6;&#xDF;erem Zeitaufwand zum Rendern der Animation).</li>
<li><strong>Dauer</strong>: spezifiziert die Animationsdauer. Wenn dieses K&#xE4;stchen nicht aktiviert ist, wird die Dauer automatisch und in &#xDC;bereinstimmung mit der Einstellung von Frame/s berechnet.</li>
</ul>
<p>Die Kombination einer Anzahl von Bildern pro Sekunde und der Dauer (ausgedr&#xFC;ckt oder berechnet) ergibt eine bestimmte Anzahl von Bildern zum Rendern. Die resultierende Anzahl von Bildern und die durch die eingegebenen Werte bestimmte Dauer werden im unteren Teil dieses Bereichs angezeigt.</p>

<h4><img src="../images/Camera.png" alt="Kamera"/>Kamera</h4>

<ul>
<li><strong>Position</strong>:
	<ul>
		<li><strong>Fixer Punkt</strong>: Die Kamera verbleibt w&#xE4;hrend der Animation in der gleichen Position. Klicken Sie auf die Schaltfl&#xE4;che dar&#xFC;ber und w&#xE4;hlen Sie einen Punkt im Modell aus.</li>
		<li><strong>Kurve</strong>: die Kamera bewegt sich entlang einer Kurve zur Definition des Animationspfades. Klicken Sie auf die Schaltfl&#xE4;che dar&#xFC;ber und w&#xE4;hlen Sie einen Pfad im Modell aus.</li>
		
	</ul>
</li>

<li><strong>Ziel</strong>:
	<ul>
		<li><strong>Fixer Punkt</strong>: die Kamera bleibt w&#xE4;hrend der gesamten Animation auf einen fixen Punkt ausgerichtet. Klicken Sie auf die Schaltfl&#xE4;che dar&#xFC;ber und w&#xE4;hlen Sie einen Zielpunkt im Modell aus.</li>
		<li><strong>Kurve</strong>: die Kamera bleibt w&#xE4;hrend der Animation auf eine Kurve ausgerichtet. Klicken Sie auf die Schaltfl&#xE4;che dar&#xFC;ber und w&#xE4;hlen Sie eine Ziel-Pfadkurve im Modell aus.</li>
		<li><strong>Vorw&#xE4;rts schauen</strong>: die Kamera bleibt vorw&#xE4;rts entlang der Pfadkurve ausgerichtet. </li>
	</ul>
</li>

<li><strong>Geschwindigkeit</strong>: zum Festlegen der Geschwindigkeit, in der die Kamera den Pfad entlang verschoben wird, berechnet in Kilometer pro Stunde. Dieser Parameter kann nicht bearbeitet werden, wenn die Dauer der Animation explizit ausgedr&#xFC;ckt wird. In diesem Fall berechnet Lands die n&#xF6;tige Geschwindigkeit der Kamera, um den Pfad innerhalb der vorgegebenen Zeit zur&#xFC;ckzulegen.</li>
<li><strong>Brennweite</strong>: steuert den &#xD6;ffnungswinkel der Kamera und wird in Millimeter angegeben. Je kleiner die Brennweite, desto gr&#xF6;&#xDF;er das Sichtfeld. Je gr&#xF6;&#xDF;er die Brennweite, desto kleiner das Sichtfeld, was einen gr&#xF6;&#xDF;eren "Zoom" des Ziels erfordert.</li>
<li><strong>Gieren, Nicken und Rollen</strong>: spezifiziert die Winkel der Kameradrehung jeweils entlang der X-, Y- und Z-Achsen. Bei der Auswahl der Option <em>Nach vorne schauen</em> k&#xF6;nnen Sie die drei Winkel frei &#xE4;ndern, da kein Kameraziel vorhanden ist worauf die Ansicht erzwungen werden kann. Wenn aber ein Kameraziel definiert wurde, kann nur Rollen angewendet werden, die einzige Drehung welche die Richtung des Kameraziels nicht &#xE4;ndert.</li>
</ul>


<h4><img src="../images/Daylight.png" alt="Tageslicht"/>Tageslicht</h4>
<p>Dieser Reiter erm&#xF6;glicht Ihnen die Anwendung einer Sonnenbewegung w&#xE4;hrend der Animation. Klicken Sie auf die Schaltfl&#xE4;che <strong>Sonnenbewegung aktivieren</strong> um einen Tag und eine Uhrzeit zu Beginn und Ende der Animation festzulegen.</p>

<h4><img src="../images/Plants.png" alt="Pflanze"/>Pflanze</h4>
<p>Dieser Reiter erm&#xF6;glicht es Ihnen, Jahreszeitenwechsel, Pflanzenwuchs und Windsimulation w&#xE4;hrend der Animation anzuwenden.</p>
<ul>
	<li><strong>Jahreszeitenwechsel aktivieren</strong>: die Animation &#xE4;ndert die Pflanzendarstellung von Jahreszeit zu Jahreszeit.</li>
	<li><strong>Pflanzenwachstum aktivieren</strong>: die Schieberegler repr&#xE4;sentieren einen Prozentsatz der minimalen und maximalen H&#xF6;henwerte jeder Art. Die Animation l&#xE4;sst die Pflanzen in &#xDC;bereinstimmung mit diesen Prozents&#xE4;tzen wachsen.</li>
	<li><strong>Wind aktivieren</strong>: spezifiziert den Effekt der Windgeschwindigkeit w&#xE4;hrend der Animation.</li>
</ul>

<a name="Render" />
<h3>3. Rendereinstellungen</h3>
<p>In diesem Bereich k&#xF6;nnen Sie die gerenderten Bilder der Animation speichern und daraus ein Video erstellen.
	<ul>
		<li><strong>Schaltfl&#xE4;che Rendern</strong>: klicken Sie auf diese Schaltfl&#xE4;che um die Animation abzuspielen und zu speichern. Geben Sie einen Namen f&#xFC;r die Animation in den <a href="Interface_AnimationPanel.html#Animation">Allgemeinen Animationsparametern</a> ein und bestimmen Sie einen Ordner f&#xFC;r die gerenderten Bilder.</li>
		<li><strong>Renderer</strong>: w&#xE4;hlen Sie zwischen dem aktuellen Rhino-Anzeigemodus im Ansichtsfenster oder Ihrer aktuellen Render-Engine in Rhino.</li>
		<li><strong>Speichern unter</strong>: w&#xE4;hlen Sie den Ordner, wo die gerenderten Bilder und das Video (im <em>.avi</em>-Format) gespeichert werden.</li>
		<li><strong>Frame-Intervall</strong>: w&#xE4;hlen Sie <em>Alles</em> um die gesamte Animation zu rendern, oder w&#xE4;hlen Sie einen Bereich von Frames aus.</li>
	</ul>
</p>
<p><img src="../images/Icon/laImageFilters.png" alt="Bildfilter"/> <strong>Bildfilter</strong>: mit dieser Schaltfl&#xE4;che wird die <a href="Commands_laImageFilters.html">Bildfilteranwendung</a> gestartet, von wo aus sie dem Ergebnis der Video-Animation einen oder mehrere Filter hinzuf&#xFC;gen k&#xF6;nnen.</p>
