<h3>Auflistungsbefehle</h3>

<div class="value toolbar"><img src="../images/Toolbar/Listing Toolbar.png" alt="Werkzeugleiste Auflistungswerkzeuge" usemap ="#ListingToolbarMap"/></div><br />
<p>Mit den <strong>Auflistungsbefehlen</strong> wird eine 2D-Tabelle mit der Information der im Modell eingef&#xFC;gten Lands-Design-Elemente eingef&#xFC;gt.</p>
<ul>
<li><a href="Commands_laListPlants.html">Pflanzenarten</a></li>
<li><a href="Commands_laListLibraryBlocks.html">Urbanes Mobiliar</a></li>
<li><a href="Commands_laListTerrains.html">Gel&#xE4;nde</a></li>
<li><a href="Commands_laListSprinklers.html">Sprinkler</a></li>
<li><a href="Commands_laListPipes.html">Rohre</a></li>
<li><a href="Commands_laListZones.html">Zonen</a></li>
</ul>
<p>Die Listen k&#xF6;nnen mit dem Befehl <a href="Commands_laExportList.html">laListeExportieren</a> im Microsoft-Excel- oder HTML-Format exportiert werden.</p>

<a name="Insert" />
<h3>Liste einsetzen:</h3>
<p><strong>Vorgehen:</strong></p>

<ol>
 <li>F&#xFC;hren Sie einen beliebigen <strong>Auflistungsbefehl</strong> aus.</li>
 <li>Spezifizieren Sie einen <strong>Einf&#xFC;gungspunkt</strong> im Modell, um die Liste einzuf&#xFC;gen.</li>
</ol>

<p>Die Liste erteilt Informationen aller im Modell vorhandenen Elemente des gleichen Typs, je nach Listeneinstellung, und aktualisiert sich automatisch wenn neue Elemente hinzugef&#xFC;gt oder vorhandene Elemente entfernt werden.</p>
<br clear="all" />
<a name="Parameters"></a>
<h3>Einf&#xFC;geoptionen und -parameter</h3>

Die Auflistungsparameter sind in unterschiedliche Reiter aufgeteilt und &#xFC;ber verschiedene Dialoge abrufbar:

<ul>
	<li>Abschnitt Listeneigenschaften, im <a href="Interface_Panel.html">Lands Design Bearbeitungspanel</a>.</li>
	<li>Liste <a href="Interface_Properties.html">Objekteigenschaftendialog</a>.</li>
</ul>

<h4>Allgemein</h4>
<p>Allgemeine Attribute f&#xFC;r das Listenobjekt: Name, Farbe, Ebene und Transparenz (nur f&#xFC;r den <em>Konzeptuellen</em> Anzeigemodus).</p>

<a name="Table" />
<h4>Tabelle</h4>
<p>Dieser Reiter definiert <strong>Textformat</strong> und -attribute f&#xFC;r Listentitel, Kopfzeile und Daten. Sie k&#xF6;nnen auch die <strong>Zellenbegrenzungen</strong> und <strong>Randeigenschaften</strong> der Liste definieren.</p>

<p class="figureWithDescription"><img src="../images/commands/List/Table List Tab.png" alt="Reiter Tabelle"/><br/>
Reiter Tabelle.
</p>

<br clear="all" />
<a name="Border" />
<h4>R&#xE4;nder</h4>
<p>In diesem Reiter werden die Tabellen-<strong>R&#xE4;nder</strong> definiert.</p>

<p class="figureWithDescription"><img src="../images/commands/List/Border List Tab.png" alt="Reiter R&#xE4;nder"/><br/>
Reiter R&#xE4;nder.
</p>

<br clear="all" />

<a name="List" />
<h4>Elemente-Liste</h4>
<p>In diesem Reiter k&#xF6;nnen Sie bearbeiten, welche Felder in der Liste erscheinen und wie sie in der Kopfzeile angezeigt werden. Lands Design ordnet allen Feldern einen standardm&#xE4;&#xDF;igen Namen zu. Diese Felder sind f&#xFC;r alle Lands-Elemente verschieden.
<ul>
	<li><strong>Felder zum Anzeigen</strong>: diese sind die f&#xFC;r das aufzulistende Objekt verf&#xFC;gbaren Parameter. Klicken Sie auf das Kontrollk&#xE4;stchen um sie anzuzeigen oder auszublenden.</li>
	<li><strong>Feldname</strong>: klicken Sie auf dieses Feld, um den Namen der Kopfzeile zu &#xE4;ndern.</li>
	<li><strong>Sortieren nach</strong>: klicken Sie auf den gew&#xFC;nschten Parameter unter <em>Sortieren nach</em> um ihn als Hauptparameter festzulegen, nach welchem die Tabelle die Werte sortiert. Klicken Sie erneut, um von <em>Aufsteigend</em> nach <em>Absteigend</em> und wieder zur&#xFC;ck zu schalten.</li>
</ul>
</p>
<p><strong>Pfeiltasten</strong>: hiermit k&#xF6;nnen Sie die Reihenfolge &#xE4;ndern, in welcher jedes Feld in der Tabelle angezeigt wird.</p>
<p><strong>Symbol Skalierung</strong>: zeigt die 2D-Darstellung des Objekts an. Sie k&#xF6;nnen den Wert der Skala bearbeiten, um die Symbolgr&#xF6;&#xDF;e zu steuern.</p>
<p><strong>Auflistung der Objekte</strong>: Sie k&#xF6;nnen bestimmen, ob Elemente <em>In Ebenen von</em> oder <em>Ausgeblendet</em> in der Liste aufgef&#xFC;hrt werden oder nicht.</p>

<p class="figureWithDescription"><img src="../images/commands/List/Plant List Tab.png" alt="Reiter Pflanzenliste"/><br/>
Reiter der Elemente-Liste f&#xFC;r eine Pflanzenliste.
</p>

<br clear="all" />

<a name="Edit" />
<h3>Bearbeitungsoptionen</h3>
<p>Dies sind die Bearbeitungsoptionen f&#xFC;r das Listenobjekt, verf&#xFC;gbar im <a href="Interface_Panel.html#Edit">Bearbeitungsbereich des Bearbeitungsfensters</a>:</p>
<ul>
	<li><img alt="Aktualisieren" height="24" src="../images/Icon/laUpdate.png" width="24" /> <a href="Commands_laUpdate.html">Aktualisieren</a></li>
	<li>Auflistung
		<ul>
			<li><a href="Commands_laExportList.html">Exportieren</a></li>
			<li>Reiter ansehen: <em>(nur f&#xFC;r Pflanzenlisten)</em>. &#xD6;ffnet die Pflanzendatenbank mit der in der Liste enthaltenen Pflanzenliste.</li>
		</ul>
		</li>
</ul>

<a name="Display"></a>
<h3>Grafische Darstellung der Liste:</h3>
<p>Eine Liste ist ein 2D-Objekt und wird immer in 2D angezeigt, unabh&#xE4;ngig davon ob der Anzeigemodus auf 2D oder 3D eingestellt ist, im Lands-Bearbeitungspanel.</p>
<br clear="all" />
<p>Die folgenden Befehle sind zur Erzeugung von Listen verf&#xFC;gbar.</p>
<p>Allen Lands-Design-Befehlen ist ein <em><strong>la</strong></em> vorangestellt, damit sie einfacher zu finden sind.</p>

